{"product":"B01MTG6NRC","count":12,"reviews":[{"title":"Stiff Price but well made, and my son loves this toy including the voice activation and sounds which were a hit","stars":4,"body":"This gets four stars because my nine year old loves this, but I feel more like it is a three if it were up to just me alone. Here is why. This is almost 200$ for this toy, and while some toys are expensive they are usually drones, robots, or huge doll houses. This is a 3.5 level BB8 standing about 18 inches, essentially dollhouse, but with not a lot to the toy. You have a retention cell, a throne, a garbage compactor, and some other rooms with sticker on the back wall. I would have expected more items to be included not just stickers to put on the walls. This does come with two 3.5 inch imperial characters and a force link arm band device. When my son wears the force link wrist band, depending what section he is playing in and what character he is using, there are sounds and phrases that are activated. He did love this aspect of the toy. So the positives are, my son loves this toy, the set is a large BB8 on the exterior which does light up, and the trash compactor, sounds, and jail cell made my son's day. The characters he loves, but he prefers the larger 6 inch star wars characters, which do not fit in this toy well, but he still loved the two figures. This in my opinion is made well, but it is so large that storage could be an issue if you have space issues. This does require 3 AA batteries and sticker adherence. If your child loves Star Wars they will love this toy, but man for 200$ for me personally I felt there should be more to this. My son loves it though, and it is made well and does have some cool features.","date":"October 17, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Kindle Customer","link":null}},{"title":"$160 TO $200 FOR THIS!!!! IF SOMEONE HANDED ME $160 TO BUY THIS FOR THEM OR PERHAPS ME!!! I WOULD TELL THAT PERSON..GO AWAY!!!!","stars":5,"body":"This Star Wars “Force Link” BB-8 playset is great for any Star Wars fan, or their kids!  This large BB-8 figure folds out into a massive empire ship playset including a throne room at the top, and a detention cell at the bottom with action decks in between.  This set is well constructed and seems quite sturdy for play action.  Six AA batteries are required.  Three AA batteries power the BB-8 lights and focalization as well as the ship lights and sounds, like alert alarms and cell doors.  The other three batteries power the “Force Link” wrist band that adds additional coolness with figure voices and additional playset sounds based on the figure being held, or where your hand is in the playset.  It is chock full of accessories and includes two figures (Supreme Leader Snoke, and a Praetorian Guard).  This playset is a bit pricey, but is well worth it for any true Star Wars fan (child or adult).  The recommended age is 4+ (there are small parts).","date":"October 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Statham rage","link":null}},{"title":"Stiff Price but well made, and my son loves this toy including the voice activation and sounds which were a hit","stars":5,"body":"The grand kids loved this playset.  It's huge when deployed and has enough action, sounds, lights and gizmos to keep the littlest Star Troopers glued to their seats while playing up  a storm.<br><br>Assembly is pretty straight forward but I think adult assistance will be required for the little guys and gals.  Three AAA and Three AA batteries are required.  The former for the ship and the latter for the wrist controller.<br><br>I thought the wrist controller (force link wrist band)  which lights lights and triggers sounds and voices in different areas of the play set itself depending on where your hand is located at the time would be the first thing to go considering you have to put it on and use it.  But the little ones love taking turns wearing it and being the one triggering different reactions and they make time every time they play to put it on.<br><br>There's several levesl of play when opened up and displayed.  From a throne room on top to a dungeon below there's action and fun on every level.  Two figures (3.75 inches) come with it and they can use their figures from other sets in the play area as well.<br><br>The price seemed really steep at $150 to $200 when this came out but it's down now to about $120 and for all you get plus the fact that the construction and design is light years ahead of the usual plastic play set in quality and construction it's getting down to a price that's well worth it for Star Wars fans and progeny. ($118.00 as of this review date)<br><br>I think it's a keeper for the wee set as a playground they'll use again and again and it's certainly a collectible for the serious collectors as well.<br><br>Five Stars","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHTLF534BT4MVCPPJJXOP27CATZQ/ref=cm_cr_arp_d_pdp?ie=UTF8\">Kindle Customer</a>","link":null}},{"title":"Mega Cool Star Wars Playset!","stars":4,"body":"This large, BB-8 shaped play-set requires a bit of parental assembly to put together. Once assembled, there’s several levels of Star Wars action, that fits the small size action figure scale. Two are included; both bad guys, which makes sense given the scene, but one hero/one villain might have been nice. Luckily, we already had quite a few Star Wars figures that fit right in. My boys would hate me saying this; but it’s basically a boy-centric doll house.<br><br>There are lights and sound effects that can also be controlled with a wrist contraption that is sure to be fought over if you have more than one kiddo, as we do. It works fairly well, but be aware both the toy AND the controller take 3 AA or AAA batteries each.<br><br>There’s one weapon that can be shot, though the red darts are sure to be quickly lost, at least in my house, and I’d prefer a little more to do on the 2 ship levels, since a gun, a throne, a jail cell (my kids' fav) and a couple of stickers are all there is.<br><br>Honestly, it almost looks/feels cooler just closed up and looking like BB-8 as room decor than it’s actual play worthiness, making me seriously question the high price point, even though my boys, 10 &amp; 6, deemed it, “cool.\"","date":"October 9, 2017","author":{"name":"Kindle Customer","link":"/gp/profile/amzn1.account.AHTLF534BT4MVCPPJJXOP27CATZQ/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"The Force Will Be With You!!","stars":5,"body":"The character-inspired, folding Star Wars Force Link BB-8 2-in-1 playset by Hasbro represents a different direction from our other vehicle-based playsets in the 3.75\" scale. First, I should acknowledge it’s great to see Hasbro do more with playsets in any scale. We’re primarily 6” Star Wars fans but that scale has difficulties translating into playsets. My son experienced love-at-first-sight with this playset in a store shortly after Force Friday.<br><br>In trying to see the value of this through his eyes, he’s a five-star believer. I have some reservations based on the value of the Force Link, value of the playset with only two figures included and some design choices, like it’s total size for storage. If I may digress for a moment, I think it made more sense to have an imperial droid represent the First Order’s base and BB-8 represent a resistance base.<br><br>Hands down, the value of this set in his eyes is the multi-level layout. The trap door, the throne room on top, the decks below and the trash compactor are brilliant features that have been sorely missing from what I’ve seen in the 3.75” 5POA line. Opened up and assembled, it looks and feels like the centerpiece of the 3.75\" scale that was missing from the new products.<br><br>In terms of the effects and electronics of Force Link, it works fine but I’m not sure of it’s lasting interest. This allowed for some expansion possibilities (sold separately). I don't know if we'll get there with a high level of interaction. I noticed the repetition he put into playing with this set was mostly because it opened up a whole new avenue to use his other 5POA and super-articulated 3.75” figures.","date":"October 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHLLCNWDABHL37SEFFK473EQLPGA/ref=cm_cr_arp_d_pdp?ie=UTF8\">Bruce and Kathy O'Gorman</a>","link":null}},{"title":"Form Over Function, But Boys Liked It","stars":4,"body":"This BB-8 toy is a lot of fun. The BB-8 itself takes 3 AA batteries and the wrist device takes 3 AAA, though the wrist thing will get tiresome and unnecessary after a while. You can get voices and several extra sounds if you hold it up to the figures or select spots on the playset. And the playset itself has several sounds just by pushing buttons. In fact, I prefer the set folded up just as BB-8 with his beeping noises even more as the playset. It'd be nice if you could just turn him around and pull out the playset, rather than having to unfold him in an obscure way - kind of like a transformer. Most of the add-on pieces for the playset have to be removed in order to fold it up to look like BB-8 again. It's a hassle and has no where to store these pieces. This has so much potential, and with a few tweaks could have been fantastic. As is, it's fun but annoying to open and close. And I wish it came with a Rebel character as well. Thankfully, these are the same size as the small figures I've collected over the years.","date":"October 17, 2017","author":{"name":"Bruce and Kathy O'Gorman","link":"/gp/profile/amzn1.account.AHLLCNWDABHL37SEFFK473EQLPGA/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"Excellent playset","stars":5,"body":"This is an impressive play set. It's sturdier than I expected. On the outside it looks like BB-8, but when it opens, it becomes a multi-level set. Some assembly is required and batteries are not included. It comes with two action figures, but I wasn't really sure who they were. I've seen the movie, but these characters are not the ones I remember. The action figures seem to be about the same size as the ones my husband grew up with in the eighties. I haven't gotten them out of storage for comparison yet. The details of the play set are pretty good. The sound effects are realistic and a fun addition. This is perfect for any young Star Wars fan!","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHJC3CKTCCD6TC43YXE3GLDK2HKQ/ref=cm_cr_arp_d_pdp?ie=UTF8\">Richard The Buying Hearted</a>","link":null}},{"title":"I love this BB-8 toy","stars":4,"body":"Since my 9-year old and 15-year old both like this, I have decided to give this four stars.<br>The kids have been big fans of star wars. This play set is really beautifully built and has some firing weapons and darts etc.<br>I do think the price is very high. But it looks great and is very playable in my view.","date":"October 17, 2017","author":{"name":"Richard The Buying Hearted","link":"/gp/profile/amzn1.account.AHJC3CKTCCD6TC43YXE3GLDK2HKQ/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"Great Details!","stars":5,"body":"Despite the price, this is an excellent diorama/playset. Well worth the investment.","date":"October 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE3DNYWFVM76LGYACN3U5UDNF4EA/ref=cm_cr_arp_d_pdp?ie=UTF8\">SW</a>","link":null}},{"title":"Good product the kids enjoy","stars":5,"body":"Thank you merry Christmas and happy new year 2018","date":"December 4, 2017","author":{"name":"SW","link":"/gp/profile/amzn1.account.AE3DNYWFVM76LGYACN3U5UDNF4EA/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"Stiff Price but well made, and my son loves this toy including the voice activation and sounds which were a hit","stars":4,"body":"So far so good","date":"November 11, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Kindle Customer","link":null}},{"title":"$160 TO $200 FOR THIS!!!! IF SOMEONE HANDED ME $160 TO BUY THIS FOR THEM OR PERHAPS ME!!! I WOULD TELL THAT PERSON..GO AWAY!!!!","stars":1,"body":"NOT IN 100 TRILLION LIFETIMES<br>WOULD I PAY OVER $60 FOR THIS<br>AND HOW BOUT THEM CARDBOARD<br>BACKGROUND FIGURES!!!!!<br>I CANNOT BELIEVE FOR THE<br>LIFE OF ME...PEOPLE ARE PAYING<br>$160 OR MORE...TO BE HONEST<br>ID HAVE A HARD TIME PAYING $60<br>IVE SPENT BIG BIG BIG MONEY ON<br>STAR WARS TOYS!!! BUT THIS TINY<br>LITTLE PLAYSET..IS ABSOLUTELY<br>INSANELY PRICED!!!!...ILL SAVE MY<br>MONEY FOR THE REAL DEAL STAR<br>WARS TOYS COMING APRIL 2018...","date":"October 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Statham rage","link":null}}]}
