[{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"EDIT: The Pixel 2 has arrived, and I am happy to report that the case and all buttons fit perfectly. It does add a good grip and feel to the phone, without being large. The Pixel 2 is a small phone, so it's not as narrow as can be with the case, but it's close. Without the case, the pixel is 70mm wide. With the case, it is 73mm. This is a hair thinner than the more plasticized case from the competitor on my 5X, which still remains much more 'tough' feeling. That case makes the Nexus 5X jump from 72 to 77mm, 2.5mm on each side. So if thin with protection is your thing, this Rugged Armor should do the job nicely.<br>Side-note: The Pixel wasn't as slippery as I thought it would be. They did a great job texturing the back of the phone.<br><br>A background: I have several Spigen cases and screen covers on my phones and when it came time to get one for the new Pixel 2, the options were slim. Spigen did have this 'Rugged Armor' case ready for shipping now (before the phones fully arrive), and since the Slim Armor and Tough Armor models were not going to be ready for another couple weeks after release I did not want to take the chance of dropping my sure-to-be-slippery Pixel within a week of getting it. The Google cases are light cases, the cloth ones are nice looking but don't provide a lot of drop resistance, which I discovered on my old Nexus 6P. Thus, since this was one of the only options available for a reasonable sub-20$ price from a reputable manufacturer at the time, I went with this Rugged Armor case.<br>The Rugged Armor case is a light, flexible side and back bumper. It adds minimal thickness to the phone. It adds a roughly 1.5mm front edge to keep the display off the table and a thicker 2.0mm backing to cushion blows from the back. It's not rubbery at all, it's a little slick, but nothing like the metal edges of a phone. It has cutouts for the fingerprint scanner, camera, sensors for the camera, a mic port on the top and bottom, and the USB-C port. The power/volume buttons are covered partially... I'll upload a picture to demonstrate.<br>The biggest issues I have with this case is how flimsy the material feels and how it's called the 'Rugged Armor' model. I used to have a Slim Armor set from Spigen on my old Nexus 5. The base rubbery bumper (which then was held in place by a more solid reinforcing wrap) felt a little sturdier than this case... this one just seems like it will twist too easily. Compared to the slim armor or other single-piece cases I've used in this price range, it feels fairly flimsy and I'm not convinced that it adds any less bulk then some of the more sturdy material models. If I compare this rugged armor one-piece to a one-piece competing brand I use for my Nexus 5X, it's very obvious which one is more sturdy, and without necessarily adding thickness in key measurements.<br>Like mentioned, an additional concern I have is the naming. I'm not sure how long Spigen's been using the 'Rugged Armor' name but it sure sounds to me like something that would be STRONGER than the 'Tough Armor' and especially the 'Slim Armor' models. This one is definitely a step behind those two, and looking at prices now, the Tough Armor (not available yet) is only a couple bucks more than this one. I will be buying a Tough Armor one down the road and I plan to compare the two cases measurement-wise to see if you are really gaining 'slimness' by going with the Rugged Armor case. While this naming isn't really an issue, if this doesn't save a healthy amount of bulk over the Slim or Tough cases it's hard to justify why you'd want this instead.<br>At the end of the day it seems that it will definitely suffice in its mission: give me more friction to hold my new Pixel in place while a different case arrives, while costing a third of what Google wants for its swanky cloth cases. Plus, the carbon fiber pattern on the back is a nice touch.<br><br>tl;dr: I wanted to give this 4/5 because it doesn't appear to be a bad case and it's not proven anything yet (I don't even have a phone to put into it), but its floppiness disappoints me when sitting next to a competitor that housed my Nexus 5X.","date":"October 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case has worked really really well, for the short time I have had it. The material seems to be pretty fingerprint and stain resistant. All in all, it is a pretty slick looking case and doesn't add too much volume to the phone, keeping it slim while still protecting the phone.","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I have been supporting this company and Diztronic for years. I have never been dissatisfied at their TPU cases. If you like to keep the case bloat down then this is the answer. Just enough protection and does not take away form the fact that you purchased a slim phone.","date":"December 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGC322Y54EL7EERWJMJ7HAQFEORQ/ref=cm_cr_arp_d_pdp?ie=UTF8\">Emily Osburn</a>","link":null}},{"title":"Great case for the price!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great looking, plain yet classy. A perfect fit which you come to expect. This is the fourth Spigen case I have purchased for different phones and they all have been fine products. It should provide adequate protection if I need it. The price provides a great value!!","date":"November 24, 2017","author":{"name":"Emily Osburn","link":"/gp/profile/amzn1.account.AGC322Y54EL7EERWJMJ7HAQFEORQ/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"Solid contender.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Although the Pixel 2 is not \"slippery\", I always feel more comfortable with a case. The Spigen Rugged Armor Case fits the Pixel 2 perfectly, is comfortable to hold and is easy to slip into and out of your pocket.","date":"November 16, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH65QEOQNQWR6OSMPBMJ3XAIMOXQ/ref=cm_cr_arp_d_pdp?ie=UTF8\">Z.Wright</a>","link":null}},{"title":"Great looking, plain yet classy!!!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Nice solid case, protects the phone well but isn't too bulky.  I did return it though - only because I didn't like the \"feel\" of it; the texture of the edges and the engraved logo on the back felt weird to me.  If you're not bothered by these things, this is an awesome case.","date":"November 13, 2017","author":{"name":"Z.Wright","link":"/gp/profile/amzn1.account.AH65QEOQNQWR6OSMPBMJ3XAIMOXQ/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"I always feel more comfortable with a case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"A lot better than the rugged armor for the Pixel 1, but I still wish Spigen would stop it with these small camera sensor cutouts, dust is still a problem here, just like it was with the P1. Luckily, the P2's camera doesn't rely as heavily on the laser sight for focusing as the P1.","date":"November 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF3NVIHFMXDJRWU5U3RBVTGDCQJA/ref=cm_cr_arp_d_pdp?ie=UTF8\">Shafqatullah Syed</a>","link":null}},{"title":"Nice solid case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this case.  It fits my Google Pixel 2 like a smooth, light glove.  The clear case I'd bought at Verizon was too bulky.  The black Spigen is perfect. Lightweight with a good grip.","date":"November 20, 2017","author":{"name":"Shafqatullah Syed","link":"/gp/profile/amzn1.account.AF3NVIHFMXDJRWU5U3RBVTGDCQJA/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"A lot better than the rugged armor for the Pixel 1","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is not the first product I've purchased of Spigen's, but once again they've met or exceeded the standard in my book. This case keeps the same slim and sleek feel of the pixel2 while providing well rounded protection. A few details I like ; The charging port is not limited at all, the case has a matte like finish very similar to the back of the device, and the camera lens remains accessible to where it can be easily wiped free of dust.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF3KIXJNMR2E3CCXWJAWKBQWTIFA/ref=cm_cr_arp_d_pdp?ie=UTF8\">L. Platt</a>","link":null}},{"title":"Love this case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Nice case. I like the carbon fiber on the back. Gives it some added design. On the slimmer side. Would give good protection. I'd say it's the same size as a tech 21 case.","date":"December 1, 2017","author":{"name":"L. Platt","link":"/gp/profile/amzn1.account.AF3KIXJNMR2E3CCXWJAWKBQWTIFA/ref=cm_cr_arp_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is a perfect fit for my Pixel 2.  Not bulky, adequate protection for typical use.  Make sure you use a screen protector that won't peel off from the sides when you use this case.  My last one did and I'm returning the protectors.","date":"November 18, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Seems generally pretty good, though it's a bit tough to hit a button at the edge of the screen because of the height of the lip -- something I think will be less noticeable after I buy and apply a tempered glass screen protector, which will raise the touch surface.","date":"November 21, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Great for Pixel 2","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love the case so far. The only drawback is that it doesn't come with a kickstand, but this case is rated much better than other cases that have a kickstand and spigen sells an attachable kickstand and that has been working great.","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGWPTXJ4ION7C3UWKAO7XLPL2ELA/ref=cm_cr_getr_d_pdp?ie=UTF8\">DDB</a>","link":null}},{"title":"Good value for the money, but steep lip","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case is nice. Not too fat not too thin. Can squeeze sides for the Google assistant function. Has a lip to keep screen off of surface if laid down on it.","date":"December 3, 2017","author":{"name":"DDB","link":"/gp/profile/amzn1.account.AGWPTXJ4ION7C3UWKAO7XLPL2ELA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case. Can add kickstand separately","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Pros: Great case, very sleek design which allows it to be slim but it doesn't leave the glass on the screen nor back facing camera exposed. I have much better grip of the phone now too and am not afraid that it will slip out of my hands. Even though it doesn't have a kick stand, if you prop it against any surface the grip I mentioned allows it lean against that surface without sliding down flat. Access to the finger print scanner for Pixel ID is flawless.<br><br>Cons: none","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE2RZQYL6SDXNQRRT7VUY7VQCUBQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Anthony Ortenzi</a>","link":null}},{"title":"Fits great and looks good too!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case offers a snug fit and manages to make the phone much easier to grip without making it that much bigger.  Unlike the<br>Trianium case I originally got, the buttons on here are really easy to press, almost easier than it is without the case.<br><br>Despite how it looks in pictures, the top and bottom of the back is not some cheap smooth piece of plastic glued on, it's a textured part of the rest of the case and looks/feels great in person.","date":"November 17, 2017","author":{"name":"Anthony Ortenzi","link":"/gp/profile/amzn1.account.AE2RZQYL6SDXNQRRT7VUY7VQCUBQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case, great price, great for dads and grads","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Works so well with my Pixel 2. Feels like it should've always been there. It's still fairly slim and less slick than the actual body of the Pixel. I like the rim around the screen (front) because it feels protected. It doesn't interfere with the finger print unlock on the back.. If anything, it makes it easier. Couldn't be happier!","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGUUM7K7NZZSLGC55VQOJEQSWZHQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">SeanGalt</a>","link":null}},{"title":"Great stylish and minimalist case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Case fit perfectly.raised edge so screen does not have direct contact with hard surface. All buttons and opening s line up correctly.  Well made","date":"October 27, 2017","author":{"name":"SeanGalt","link":"/gp/profile/amzn1.account.AGUUM7K7NZZSLGC55VQOJEQSWZHQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Slim and perfect for the Pixel 2!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Really great case! Feels really nice and comfortable in your hand. Very sleek looking and the finish has a nice feel to it. It definitely gives the phone all of the protection it needs! Doesn't interfere with the camera, the flash, nor the finger print reader. Everything works flawlessly. Would definitely recommend!","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFN3UGTNEWXM3J3ATTWULNOCYSIA/ref=cm_cr_getr_d_pdp?ie=UTF8\">jdubs</a>","link":null}},{"title":"Great case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"It's a good case for the price. The fit is perfect and it looks great. Only four stars because I've had cases with better confidence (seriously, dropped my last phone down the elevator shaft of the tallest building in Indiana and it survived) and the insides of this one aren't very gummy; I'm concerned about impact survival. Still, fit and finish are excellent!","date":"November 20, 2017","author":{"name":"jdubs","link":"/gp/profile/amzn1.account.AFN3UGTNEWXM3J3ATTWULNOCYSIA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I love this case. Very compact...adds maybe a millimeter to the thickness of the phone and seems to protect it very well.","date":"December 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Very satisfied with this thin rugged armor case. Even has nice touch of carbon fiber on the bottom and top of the back cover.","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Love it","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I ordered this case the day I ordered my pixel 2 and for the price I am impressed. The case doesn't add much bulk and makes holding the pixel 2 feel easier than before. The buttons are nice and responsive, and the lip around the front leaves room to lay my phone flat knowing I won't scratch the screen on a table. All in all for the money this case offers you pretty solid protection while keeping the design of the pixel 2 in mind.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AENI7OCA44OPD5AYJKLT4GGVJ42Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Tristan Heberlein</a>","link":null}},{"title":"Nice rugged armor","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case - had one on my old phone and bought another when I got the pixel 2. Protects well and adds virtually no bulk, and a great price point. I'd buy 3 or 4 of these before buying an expensive case.","date":"December 9, 2017","author":{"name":"Tristan Heberlein","link":"/gp/profile/amzn1.account.AENI7OCA44OPD5AYJKLT4GGVJ42Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Solid Case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Study case. Works well and keeps the profile minimal so the phone does not feel so huge while offering drop protection.","date":"November 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEE3CJS4RHWNIVT5D63H3TZJPJNA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Bing Zheng</a>","link":null}},{"title":"Great case - had one on my old phone and ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Arrived quickly.  Very nice case - light yet still feels substantial enough to protect my phone.<br> Fits perfectly. Feels good in my hand.","date":"November 18, 2017","author":{"name":"Bing Zheng","link":"/gp/profile/amzn1.account.AEE3CJS4RHWNIVT5D63H3TZJPJNA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Good basic protection.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Case fits well and has protected my phone through a few drops.  It is smooth enough to slide in a pocket while not being slippery to hold. The separated power/volume buttons are better on this one than the one piece, more flush buttons that I had on my first pixel. Makes them easier to navigate without looking.  Have had for about a month and am very happy with it.  Have had good experiences with Spigen for a few phones.","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFLMJ5NHMAW5D3NMBFKF4CHWDIXQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jorge</a>","link":null}},{"title":"Very pleased","stars":"a-icon a-icon-star a-star-4 review-rating","body":"awesome case. perfect fit, extremely high quality.<br>however, it fits SO WELL that it can be difficult to get on correctly if you use a screen protector that goes all the way to the edge. worst case, it might actually catch the edge of the screen protector and lift it (almost happens with the \"official\" protector from the Google store)","date":"November 21, 2017","author":{"name":"Jorge","link":"/gp/profile/amzn1.account.AFLMJ5NHMAW5D3NMBFKF4CHWDIXQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The separated power/volume buttons are better on this one than the one piece","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love the case for my new Pixel 2. Fits like a glove and you can tell it's a quality item. Great price too. A+","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFJSV6OVGHE3O2PNE2W6GU37T3HA/ref=cm_cr_getr_d_pdp?ie=UTF8\">S Tyler Constantine</a>","link":null}},{"title":"great quality. perfect fit.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"great case for pixel 2. had original bought the $40 one that google sells with the phone (not good at all)","date":"November 16, 2017","author":{"name":"S Tyler Constantine","link":"/gp/profile/amzn1.account.AFJSV6OVGHE3O2PNE2W6GU37T3HA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect for pixel 2, high quality, great feel. Haven't dropped my pixel 2 yet. Will update if I do....","date":"December 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-3 review-rating","body":"The case feels sturdy enough, like it would get the job done, but there are rough spots and hard edges that give it a terrible feeling in my hand.  Anyone who is a relatively heavy phone user might find, as I did, that it's rubbing sore places into my hand and fingers. Not a keeper, unfortunately.","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Perfect for pixel 2","stars":"a-icon a-icon-star a-star-5 review-rating","body":"A very nice case. I don't like big bulky cases on my phone, I don't even like cases on them. But for the pixel too spending the money on I wanted to protect it. This case is great because it is thin and doesn't add to much bull. The cutouts are perfect for the phone everything that needs to be out is. It has a nice feel too it and seem solid overall. Great case for the price!","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHNC3XQ5AS3TV7NPGKICSMX735MQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">paul</a>","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is a great light weight case for the pixel 2. It slips on and off, and blends in well with the design of the phone. It's light and flexible, but feels sturdy enough to protect my phone.","date":"December 3, 2017","author":{"name":"paul","link":"/gp/profile/amzn1.account.AHNC3XQ5AS3TV7NPGKICSMX735MQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Solid case but a bit thick so if you use a magnetic mount in car where you put a piece of metal on the back of phone, this weakens the magnet pull. You can put the metal outside but that catches on all sorts of things and looks ugly. Wish Spigen would make a small insert area so you can slide the metal in or better yet, have a metal piece built in!","date":"November 12, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGDD4KUHPVKRUAX7OHMRDMMJNSYQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"This is a great light weight case for the pixel 2","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this case! It is sleek and classy looking. I was worried the squeeze wouldn't work as well on my pixel but works great with this case. Super happy with it!","date":"November 30, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AGDD4KUHPVKRUAX7OHMRDMMJNSYQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Good case.","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Trivial to attach. Helps me grip the phone with more certainty. The carbon fiber looks nice, but certainly feels fake, though I guess that's to be expected. The only real complaint I have is that the edges around the face of the phone can block my thumb a bit from easily touching the edges of the screen, making certain gestures a little more troublesome.","date":"November 11, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFYCQCBJYGUK2GEN2JLWU5PRUTRA/ref=cm_cr_getr_d_pdp?ie=UTF8\">garrett</a>","link":null}},{"title":"Great case!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"It's a good case. Grippy in they right ways.Looks good. Offers good protection, at the cost of some added weight.","date":"November 9, 2017","author":{"name":"garrett","link":"/gp/profile/amzn1.account.AFYCQCBJYGUK2GEN2JLWU5PRUTRA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The carbon fiber looks nice, but certainly feels fake","stars":"a-icon a-icon-star a-star-2 review-rating","body":"Does not work with the screen protector I purchased from Amazon with a thickness of .026mm.  The edge of the cover gets under the protector and flips it up leaving the touch screen not connected to the phone.  Hard to text and use other functions of the phone screen on that side.  I will return this to Amazon.","date":"December 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFQMGBNMPQHWZD3OMLVO32RRWEVA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Scott</a>","link":null}},{"title":"It's a good case. Grippy in they right ways","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Real good snug fit!  Cut outs are accurate.  Matte surface helps with grip to avoid accidental drops.  The back thickness is noticeable so you'll have to adjust your fingerprint unlock (just so slightly).  If anything, it's an improvement because I would always touch it by accident.  Now you need to unlock it intentionally.","date":"November 16, 2017","author":{"name":"Scott","link":"/gp/profile/amzn1.account.AFQMGBNMPQHWZD3OMLVO32RRWEVA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is an amazing case. Perfect sung fit. Highly recommended","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case so far.  No complaints! I had a similar case on my LG G4 and despite all the times I dropped it it performed magnificently. So far I haven't broken it in too much but if I do I'm sure the case and phone will hold up.","date":"November 12, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Best Pixel 2 case!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Looks great and fits perfectly.  Definitely protects the phone well.","date":"November 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHSZGB5MHMVLFFNPBXIKQO3OSB3A/ref=cm_cr_getr_d_pdp?ie=UTF8\">Sour Grapes USN</a>","link":null}},{"title":"Great case so far","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I always love Spigen cases and this case for my Pixel 2 is perfect. Fits beautifully and perfect protection. Definitely recommend for a slick yet sturdy case.","date":"October 31, 2017","author":{"name":"Sour Grapes USN","link":"/gp/profile/amzn1.account.AHSZGB5MHMVLFFNPBXIKQO3OSB3A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It's a good case and minimizes any bulkiness.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHSDN4XUOSW4HETLB2MTFVYR36NQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Brent Stanton</a>","link":null}},{"title":"Great case for Pixel 2","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Another great case by Spigen. I have been using there products since my Galaxy S5 and each case has been perfect. I like how it is not bulky and is a very minimalist design. I have dropped every phone I have ever owned and it has been in a Spigen case. I have yet to use my protection plan thanks to their products.","date":"November 13, 2017","author":{"name":"Brent Stanton","link":"/gp/profile/amzn1.account.AHSDN4XUOSW4HETLB2MTFVYR36NQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"It's a good case, no complaints.","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Great looking case. I had one for my Galaxy S6 and it served me well through lots of drops. The only problem I have is the dust collection and that it could be a little more grippy. Sometimes it feels like it might slide out of my hand. Other than that, great case for a god price.","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGYQKTQSCLOUPY43RBTA3VV5LK7Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">M. Winslow</a>","link":null}},{"title":"Another great case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is my third phone and third rugged armor case.  Fits well, feels good in your hand and gives good protection.  My favorite case and I have tried many.","date":"November 11, 2017","author":{"name":"M. Winslow","link":"/gp/profile/amzn1.account.AGYQKTQSCLOUPY43RBTA3VV5LK7Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great looking case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fit perfectly and looks good. Power and volume controls work great.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEKGRIU3L34XFFKLJ7UF5QFL535Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Son Lam</a>","link":null}},{"title":"Favorite case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case. Not disappointed","date":"November 22, 2017","author":{"name":"Son Lam","link":"/gp/profile/amzn1.account.AEKGRIU3L34XFFKLJ7UF5QFL535Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Spigen is always a sure bet","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Excellent quality and value!","date":"December 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"fits pixel2 nicely. Not overly bulky","date":"November 21, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFQPJK53XJQM34Q7XYKKLKUIP22A/ref=cm_cr_getr_d_pdp?ie=UTF8\">HELIOS</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"very nice and great fit.","date":"November 20, 2017","author":{"name":"HELIOS","link":"/gp/profile/amzn1.account.AFQPJK53XJQM34Q7XYKKLKUIP22A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Not as rugged or bulky as the Otterbox Defender cases I'm used to, but my wife wanted a smaller case that fit better in her pocket.  This fits that bill perfectly.  I'm skeptical of any drops on the phone corner, but until then, 5 stars.","date":"November 19, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEIRR5LBKAZPRYHH3G4EB4YGYKCQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jeffrey D</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"My son loves it","date":"December 3, 2017","author":{"name":"Jeffrey D","link":"/gp/profile/amzn1.account.AEIRR5LBKAZPRYHH3G4EB4YGYKCQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"but my wife wanted a smaller case that fit better in her pocket","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fits well. Sturdy and not too bulky.","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE6HLAEFZ2VKF2MOITWAQGILHT2Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Dave</a>","link":null}},{"title":"Good","stars":"a-icon a-icon-star a-star-5 review-rating","body":"this is the case of choice","date":"November 16, 2017","author":{"name":"Dave","link":"/gp/profile/amzn1.account.AE6HLAEFZ2VKF2MOITWAQGILHT2Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Sturdy and not too bulky","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I wanted a simple, low profile, quality case and that's exactly what this is. Fits well, material has a quality feel, adds minimal bulk, and appears to add plenty of protection to stand up to basic daily wares of city life. It's not flashy, it just gets the job done.","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH6LNTT752VTP2M6UV3DOWYCS24Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Scott Evers</a>","link":null}},{"title":"clean and nice fit","stars":"a-icon a-icon-star a-star-5 review-rating","body":"nice and sleek. protects phone well. simple design. haven't had any issues.","date":"December 1, 2017","author":{"name":"Scott Evers","link":"/gp/profile/amzn1.account.AH6LNTT752VTP2M6UV3DOWYCS24Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The Spigen case fits my new Pixel 2 like a glove. This is as good, if not better, than the OtterBox case that I had on my previous phone - the Samsung 6. Cut outs on the Spigen are exactly where they need to be for the cameras and fingerprint recognition function.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I like Spigen cases. I had a Spigen on my Samsung Galaxy and now I have one on my new Google pixel 2. This case is sleek and comfortable. I think this case will offer good protection when I drop my phone.","date":"November 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"The Spigen case fits my new Pixel 2 like a glove","stars":"a-icon a-icon-star a-star-5 review-rating","body":"very good case. Very protective.","date":"November 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHQET4UUH7RPYJNQNHF3MUSYCMQA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Stan Poltack Jr</a>","link":null}},{"title":"I like Spigen cases","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great affordable case... I wouldn't doubt Spigen, dropped my with off the 2nd floor balcony and the phone is in perfect condition. This is something I learned, always got with Spigen!","date":"November 12, 2017","author":{"name":"Stan Poltack Jr","link":"/gp/profile/amzn1.account.AHQET4UUH7RPYJNQNHF3MUSYCMQA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"good case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Just what I was looking for. Slim but sturdy. Buttons and fingerprint functionality work great.","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEZHYMEZPXEVCH6JF37KRIWOPHPA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"Great affordable case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Easy to put on. Phone feels protected and has raised edges for face drops. Good grip. Makes the active edge easier to squeeze compared to not having a case. Great value.","date":"December 7, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AEZHYMEZPXEVCH6JF37KRIWOPHPA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Fits Pixel 2 Great","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Nice fit. Good button reaction. Not very bulky at all. However, the slim form factor does not allow for the most robust do protection. I take pretty good care of my phones and this case works very well for me. I know it will increase the survivability of my pixel 2.","date":"November 19, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEVSMG4KSLBZNERJT6SP6X6JNRDQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">booklover</a>","link":null}},{"title":"Great choice for Pixel 2","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Solid case. I'll keep it but I ended up going with a transparent case from Spigen.","date":"November 7, 2017","author":{"name":"booklover","link":"/gp/profile/amzn1.account.AEVSMG4KSLBZNERJT6SP6X6JNRDQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Nice fit. Good button reaction","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Exactly as described. Quick shipping too! Yes dust builds up around the edge. Simply pull the case off, wipe the screen and the edge, reinstall. Takes all of 30 seconds, no big deal at all.","date":"November 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEDK2S556B7S5SUIVJ4ASC43NDSQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Eric L. Soung</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Extremely happy with this case. Buttons have a great feel as does the case. Squeeze-for-assistant is not hindered at all. This is the best case I've ever bought for a phone.","date":"November 7, 2017","author":{"name":"Eric L. Soung","link":"/gp/profile/amzn1.account.AEDK2S556B7S5SUIVJ4ASC43NDSQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It is really nice quality, I love it.","date":"November 17, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Always one of the first companies to release good, protective cases that don't look ridiculous for new phones. I've never had an issue and I've bought Spigen cases for iPhone, Samsung and now Google phones.","date":"November 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Really solid case, feels good in your hand. Seems like it protects the phone well, not super bulky. Great product!","date":"November 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG7MPMFQDCAGHUQ4QYOOIU33BPAQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Rossy</a>","link":null}},{"title":"Protective and sleek","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This has been a good case so far, it is a snug and thin fit not adding much weight or bulk.  It is a harder rubber so it adds some grip to the phone.  The protection should be enough to protect the phone in the event of a drop, though I have not tested that yet.","date":"December 9, 2017","author":{"name":"Rossy","link":"/gp/profile/amzn1.account.AG7MPMFQDCAGHUQ4QYOOIU33BPAQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"feels good in your hand","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The cover is sleek and clean looking. Fits the Pixel 2 phone perfectly.","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF2CR6MXB3YZZR5MLFB7Z6S23NZA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Brittany</a>","link":null}},{"title":"This has been a good case so far","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case is easily installed. I can place the phone in my pocket and remove it from my pocket easily while the case is installed. I have a screen protector installed with this case and both function well together.","date":"November 30, 2017","author":{"name":"Brittany","link":"/gp/profile/amzn1.account.AF2CR6MXB3YZZR5MLFB7Z6S23NZA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Awesome phone case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Protects phone decently without adding a lot of bulk. You will need to buy a screen protector compatible with all cases because this case fits on so tight it pushed the edge of my screen protector up a little. Still good though","date":"December 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHZFQPHQDWOIMBFITTTR7UTIXSDQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Brett Kolb</a>","link":null}},{"title":"Small Case, Good Protection","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case so far. fits on easily, stays on. does what it is supposed to and looks decent without adding much bulk.","date":"November 12, 2017","author":{"name":"Brett Kolb","link":"/gp/profile/amzn1.account.AHZFQPHQDWOIMBFITTTR7UTIXSDQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Pretty Good","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I just got this case, but am very happy with it so far. Feels light around the phone but also sturdy. Doesn't attract dust and looks nice.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG7T2M5HRFHLASEPJZKKZOJEUU5A/ref=cm_cr_getr_d_pdp?ie=UTF8\">Lupus</a>","link":null}},{"title":"Great case so far","stars":"a-icon a-icon-star a-star-5 review-rating","body":"fits snugly, pretty lightweight and does not add bulk.","date":"November 17, 2017","author":{"name":"Lupus","link":"/gp/profile/amzn1.account.AG7T2M5HRFHLASEPJZKKZOJEUU5A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits the Pixel 2 great and has a very nice feel to it.","date":"November 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Like that offers bevel protection. Plenty of clearance between the screen and the ridge. Nice grippy feel, very happy with the details.","date":"November 8, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I tried the Spigen Thin Fit case for the Pixel 2, but I didn't feel like it provided enough drop protection, so I went with this guy. Definitely, been happy with the look and feel.","date":"November 22, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGX5RFNTXDIMLBIDKO2RN4Y2V2RQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Bryan W Gates</a>","link":null}},{"title":"Elegant while protective","stars":"a-icon a-icon-star a-star-4 review-rating","body":"It was hard to tell from the picture if this would wrap around the front of the phone,  I was pleasantly suprised to see that it did.  Ultra slim and appears to be good quality.  Will wait to give it five stars until the first drop happens.","date":"December 4, 2017","author":{"name":"Bryan W Gates","link":"/gp/profile/amzn1.account.AGX5RFNTXDIMLBIDKO2RN4Y2V2RQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"but I didn't feel like it provided enough drop protection","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is the 3rd Spigen one I have purchased for different phones. I have never had a broken iPhone and now I am sure I will never have a broken Google Pixel. I only buy Spigen for my phones.","date":"November 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGF4SDXEA3VTM5WFEZQQV3QUI5ZA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Daniel Soto</a>","link":null}},{"title":"Ultra slim and appears to be good quality. Will wait to give it five stars ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I would recommend this to anyone who has a pixel or any thin device it is built very well looks classy good to the feel I am very impressed with the Quality. I wish it came in other colors I would buy a lot more of them.","date":"December 8, 2017","author":{"name":"Daniel Soto","link":"/gp/profile/amzn1.account.AGF4SDXEA3VTM5WFEZQQV3QUI5ZA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Best Case Ever","stars":"a-icon a-icon-star a-star-1 review-rating","body":"This isNOT for the Pixel 2 and it's is not flexible and easy to put on like it shows in the photos. It's hard plastic and thin, I do not think it would survive a single drop.","date":"December 8, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF3LC4VO4AZK5QJMP5R4EV44ZCWQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">A Constant Student</a>","link":null}},{"title":"This is a well-built device.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"After getting the smaller Pixel 2 phone I ended up getting this case, its exactly like the one I have for my HTC 10 and this one is just as great, perfect fit and I like the look and feel.","date":"November 22, 2017","author":{"name":"A Constant Student","link":"/gp/profile/amzn1.account.AF3LC4VO4AZK5QJMP5R4EV44ZCWQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Inaccurate description.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great product and great value. Fits perfectly.","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFVJ5OQQD2T3VAOYSJBKI5NUB24A/ref=cm_cr_getr_d_pdp?ie=UTF8\">travis</a>","link":null}},{"title":"Great Quality Case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"good phone cover for the price","date":"December 1, 2017","author":{"name":"travis","link":"/gp/profile/amzn1.account.AFVJ5OQQD2T3VAOYSJBKI5NUB24A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, high quality, have not thrown the phone against the wall, bit it looks strong!","date":"November 17, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fits tight looks great.  Very happy with this so far.","date":"November 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-4 review-rating","body":"I like the way the case looks and it fits well. I just dropped my phone from a 4 ft high table and it survived without damage. The case is just too smooth. It needs more texture to avoid slipping out of hand.","date":"November 18, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHVBIN4TBBEWVAJ54OP6OAQR6YEQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ed</a>","link":null}},{"title":"Fits tight looks great. Very happy with this so far","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fit the pixel 2 just right, seems to be protective enough for my 14 year old","date":"November 29, 2017","author":{"name":"Ed","link":"/gp/profile/amzn1.account.AHVBIN4TBBEWVAJ54OP6OAQR6YEQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"I like the way the case looks and it fits well","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Just got this 2 days ago and it seems to be great. Stylish design and good feel (grippy enough but doesn't get caught on pants pockets). Been only a short time but seems like a great purchase.","date":"December 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG25TUIWNKMUEEYBUR2WKTA2IFRQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">PFSBY</a>","link":null}},{"title":"Good fit, good protection","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great and the buttons are easy to push.","date":"November 14, 2017","author":{"name":"PFSBY","link":"/gp/profile/amzn1.account.AG25TUIWNKMUEEYBUR2WKTA2IFRQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Quality phone case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, slim design. Recommend it.","date":"November 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFZJKDQHZEHBUYSTBOEEB66X3T3A/ref=cm_cr_getr_d_pdp?ie=UTF8\">Todd Wilson</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great, very secure on the phone. Easy access to the fingerprint button on the back, and the squeezable sides still work without having to press too hard.","date":"October 31, 2017","author":{"name":"Todd Wilson","link":"/gp/profile/amzn1.account.AFZJKDQHZEHBUYSTBOEEB66X3T3A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Recommend it.","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fits great. Like that it's not too bulky.","date":"December 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGFRFVABSLVZQW5NIFONBYEORUZQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">blkhawks11</a>","link":null}},{"title":"Good case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Oh my, what a perfect fit!  I hesitated because it looked \"flimsy\".  Tried a different case, nothing lined up.  This one fits perfectly, very happy.","date":"November 8, 2017","author":{"name":"blkhawks11","link":"/gp/profile/amzn1.account.AGFRFVABSLVZQW5NIFONBYEORUZQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case fits my Pixel 2 perfectly. It arrived very quickly and snapped right on. I like the feel of this case. It has good texture without being so gripping the inside of my pocket.","date":"October 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is my third case for my third phone. Spigen uses great R&amp;D to make sure their cases fit spot on! Highly recommended.","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Great case especially for the money","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great. Squeeze function works no problem. Glad I got it.","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGHFGSLK3XDQC4627CPUM6FWKHZQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Eric D. Boerngen</a>","link":null}},{"title":"Awesome Product!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case! Bought the Google case on launch just to have a case when it got here but that was way to slippery. This spigen case grips great. Adds no bulk to the phone. Definitely recommend!!","date":"November 14, 2017","author":{"name":"Eric D. Boerngen","link":"/gp/profile/amzn1.account.AGHFGSLK3XDQC4627CPUM6FWKHZQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"My go to for phone cases. I've had this brand twice before on different phones and the cases always saved my phone. They look good while doing it.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH2VUNNIP2QDMQM5IPKWOZ6F4KPQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ryan</a>","link":null}},{"title":"Best case!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits very well and covered the whole phone. Slightly raised around the edges to prevent screen scuff. Not overly bulky and add a skittles grip to the otherwise slippery phone","date":"November 9, 2017","author":{"name":"Ryan","link":"/gp/profile/amzn1.account.AH2VUNNIP2QDMQM5IPKWOZ6F4KPQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"My go for cases","stars":"a-icon a-icon-star a-star-4 review-rating","body":"The case fits well and feels comfortable in the hand.  Is it actually strong enough to protect the phone if it drops, I don't know.","date":"November 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AENTTXV5IF4NAHFQOUVM25O7EJWQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">philychez</a>","link":null}},{"title":"Solid product","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case fits perfectly and isn't too thick.  It's grippy enough to make holding it easy.  Hopefully I never drop it to find out how well it protects but expect it will be as good as any other soft case.","date":"December 3, 2017","author":{"name":"philychez","link":"/gp/profile/amzn1.account.AENTTXV5IF4NAHFQOUVM25O7EJWQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The case fits well and feels comfortable in the hand","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Awesome soft case with hard fake carbon fiber inlays. I might have prefer this over my $40 Google case!","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHLSTRCFB6FD5Q4S42BO37FSCKPA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jeff</a>","link":null}},{"title":"Fits well, isn't too thick and has just enough grip.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Really nice looking case, sleek, fingerprint reader still easily accessible and works perfectly fine with the case.","date":"October 26, 2017","author":{"name":"Jeff","link":"/gp/profile/amzn1.account.AHLSTRCFB6FD5Q4S42BO37FSCKPA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits like a glove","date":"December 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case, covers the phone perfectly to make it safe. You are still able to charge, use your fingerprint and squeeze for Google Assistant with the phone case on.","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Basic TPU case for the Pixel 2. One-piece with a slim profile. \"Carbon fiber,\" accents look better than expected. Everything lines up great!","date":"November 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFMZIBFDWO2ASMDC3ORB4E76CKHA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Shonisani</a>","link":null}},{"title":"Great case, covers the phone perfectly to make it ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Nice case. Buttons work well, as well as squeezable sides.","date":"November 21, 2017","author":{"name":"Shonisani","link":"/gp/profile/amzn1.account.AFMZIBFDWO2ASMDC3ORB4E76CKHA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Excellent TPU Case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great fit. Easy to put it on/remove for cleaning sake. Gives a good hold on the phone and feels fantastic too. Overall super happy with the case.","date":"October 31, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF6IMJKPYFKPO3GGK77KBSIW2FDA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Lori A Holt</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It was exactly what I was looking for! It looks so sleek and the finger print is not a problem at all! The lock and volume buttons are also working perfectly. Would definitely recommend :)","date":"December 3, 2017","author":{"name":"Lori A Holt","link":"/gp/profile/amzn1.account.AF6IMJKPYFKPO3GGK77KBSIW2FDA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great fit. Easy to put it on/remove for cleaning ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is a great case.  It has a snug fit and looks cool too.  Can't beat it.","date":"November 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGXIWSRB4OOHQ2HG2TC723YPCFFA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Andrew K.</a>","link":null}},{"title":"Just what I was looking for","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Product arrived as described - perfect fit and I like the fact it doesn't add much bulk to the phone.","date":"December 5, 2017","author":{"name":"Andrew K.","link":"/gp/profile/amzn1.account.AGXIWSRB4OOHQ2HG2TC723YPCFFA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"This is a great case. It has a snug fit and looks ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I love Spigen's phone cases. They're sleek and professional looking and provide protection for your phone from every angle compared to others.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGNFVBSWV63USYNUTAZP6D2RLCSQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">John Huang</a>","link":null}},{"title":"Product arrived as described - perfect fit and I like the fact it doesn't add ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect fit.","date":"November 8, 2017","author":{"name":"John Huang","link":"/gp/profile/amzn1.account.AGNFVBSWV63USYNUTAZP6D2RLCSQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits the pixel two perfectly. Very slim","date":"November 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits my Pixel 2 perfectly. Buttons are easy to use. Maintains squeeze feature perfectly Not as bulky as others.","date":"November 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case. Love the feel and the look","date":"November 11, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFYCFHBXZT2B3KCNXP7XESACNJIA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jesse J.</a>","link":null}},{"title":"Buttons are easy to use","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great looks great, I can now feel my pixel2 even better and this adds a lot of grip to it. I would highly recommend this doesn't the best price it is offering. Way to go","date":"October 25, 2017","author":{"name":"Jesse J.","link":"/gp/profile/amzn1.account.AFYCFHBXZT2B3KCNXP7XESACNJIA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"10/10","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Good inexpensive case. Fits real snug. Not very grippy. Feels like the naked phone does.","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF3H3M5VZG3LLNRGGFF3FXPSZUPQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Daniel O'Brien</a>","link":null}},{"title":"Fits great looks great","stars":"a-icon a-icon-star a-star-5 review-rating","body":"As far as I'm concerned there's no better case for the price.","date":"November 3, 2017","author":{"name":"Daniel O'Brien","link":"/gp/profile/amzn1.account.AF3H3M5VZG3LLNRGGFF3FXPSZUPQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Four Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits well &amp; remains snug.  This has provided good protection while remaining low profile enough to comfortably slide into a pocket.","date":"December 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEHXW7XAMPTNBQN7ET6QL5OJRZCQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Daniel Sikora</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Quick delivery! Fits the phone perfectly and it's soon but still provides protection! Will be buying this brand from now on! Great value!","date":"November 17, 2017","author":{"name":"Daniel Sikora","link":"/gp/profile/amzn1.account.AEHXW7XAMPTNBQN7ET6QL5OJRZCQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"This has provided good protection while remaining low profile enough to comfortably slide ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this case, it's solid and price is good.","date":"November 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF47BKR2ZRAXVOOG3ZPAVB3H5CVQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"Great value!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"The case fit perfectly, you can squeeze to load the assistent without issue.<br>Looks great","date":"December 1, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AF47BKR2ZRAXVOOG3ZPAVB3H5CVQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I honestly didn't think it was going to be a great product because of the price but I'm in love! It's one of the best cases I've ever gotten. Definitely recommend.","date":"November 16, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Case fits great. Love the feel and really compliments the phone aesthetic.","date":"November 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Good quality!!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Easy to install &amp; allows activating Google Assistant by squeezing the lower half of case. Wish it included a screen protector. I had to order one separately.","date":"November 22, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFAFZN3JK7KXWXT6MUPGWI4E423Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Lidia</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great, and looks like it will be great protection!","date":"November 13, 2017","author":{"name":"Lidia","link":"/gp/profile/amzn1.account.AFAFZN3JK7KXWXT6MUPGWI4E423Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Allows activating Google Assistant w/ a squeeze","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Just as slippery and hard to grasp as the phone itself. However, the buttons and openings line up great.","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFWSHQLFLXCS5ZBGHOK25GIAJBVA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Michael D.</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"just like some other post was looking for a better brand but was very surprised how well the product is made and the price is great","date":"November 30, 2017","author":{"name":"Michael D.","link":"/gp/profile/amzn1.account.AFWSHQLFLXCS5ZBGHOK25GIAJBVA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"So, so","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is a compact case that fits the Pixel 2 well. The sides allow you to squeeze the side of the phone to start Google Assistant.","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHG56NJV5ZBCS77IKGJRT3JTEIZQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ralph Kennedy</a>","link":null}},{"title":"just like some other post was looking for a better brand ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, looks good. I feel it offers good protection.","date":"November 13, 2017","author":{"name":"Ralph Kennedy","link":"/gp/profile/amzn1.account.AHG56NJV5ZBCS77IKGJRT3JTEIZQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Compact, good fit","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Probably one of my favorite cases. It adds no bulk and has a clean look. I've dropped my pixel a few times with this case on and have no damage.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE3Q5MUPQLZQ67AKUHZ3F564KFNQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Kassie</a>","link":null}},{"title":"looks good. I feel it offers good protection","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Looks great. Nice grippy feel to it and functions well with the Pixel, no inhibition to the \"squeeze function\". Nice and low profile.","date":"December 1, 2017","author":{"name":"Kassie","link":"/gp/profile/amzn1.account.AE3Q5MUPQLZQ67AKUHZ3F564KFNQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great balance for protection and bulk. It fits nicely and feels good in my hand.","date":"November 14, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect fit and great feel","date":"November 19, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Solid case, great price","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits the Pixel 2 great. I haven't used it with a screen protector yet, but I'd highly recommend this case.","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH24PHAA6RLEXVYPRUA6KPA6AH7Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Kyle</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits the pixel 2 perfectly and provides a good amount of protection for the phone. For the money, it's a great purchase.","date":"October 28, 2017","author":{"name":"Kyle","link":"/gp/profile/amzn1.account.AH24PHAA6RLEXVYPRUA6KPA6AH7Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"This case fits the Pixel 2 great. I haven't used it with a screen protector ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Had this case for my 6p.  Trust the brand, and they deliver.  Solid case for my Pixel 2","date":"November 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHOGDR7GXPY5I2NRC6ATTKTDI5HQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">QuincyPug</a>","link":null}},{"title":"Reliable case.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, without taking away from the slim design. Can access all buttons easily and does not impede the squeeze feature.","date":"November 19, 2017","author":{"name":"QuincyPug","link":"/gp/profile/amzn1.account.AHOGDR7GXPY5I2NRC6ATTKTDI5HQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfect and give peace of mind with just the feel of the material.","date":"December 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHLG6P3NZ2Y2H7FHMK6K36OV2M2Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Erik</a>","link":null}},{"title":"Can access all buttons easily and does not impede the squeeze feature","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Looks great, easy to put on the phone. Slight lip on the front protects from screen breaking. No complaints here.","date":"November 19, 2017","author":{"name":"Erik","link":"/gp/profile/amzn1.account.AHLG6P3NZ2Y2H7FHMK6K36OV2M2Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Does what it says it does.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case for the pixel 2.  =)","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFKDANEWD3FXIY3UVXSDBKU7PBZQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jason Thomas Renne 2</a>","link":null}},{"title":"Looks great, easy to put on the phone","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case is not bulky and it slides onto the phone easily. The active edge can still be used without any issues.","date":"November 13, 2017","author":{"name":"Jason Thomas Renne 2","link":"/gp/profile/amzn1.account.AFKDANEWD3FXIY3UVXSDBKU7PBZQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Good product. Fits perfectly. Only complaint is that I wish it had a bit more grip on the back to prevent sliding from pocket.","date":"December 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Case grips well and allows all functionality of phone with the squeeze and power and volume selectors! Love it","date":"December 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Good product. Fits perfectly","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It is all I expected and more. Feels good in hand and looks good. I would buy again.","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEI7LXAHBE6EAZ57XLTQ6RWFSEMQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Joshua Kammeraad</a>","link":null}},{"title":"Great case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Minimalist design but nice overall quality","date":"November 18, 2017","author":{"name":"Joshua Kammeraad","link":"/gp/profile/amzn1.account.AEI7LXAHBE6EAZ57XLTQ6RWFSEMQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Good case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"For those updating from a Nexus 5X: This has the same feel as the Adoptec case that shipped with the Nexus 5X.","date":"November 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH5NA65HIHQHWHYQ2W7B5VKB24GQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">justin robertson</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"a great, protective case for the pixel 2","date":"November 3, 2017","author":{"name":"justin robertson","link":"/gp/profile/amzn1.account.AH5NA65HIHQHWHYQ2W7B5VKB24GQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"For those updating from a Nexus 5X: This has ...","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Case fits very well, used Spigen case on previous phone and it worked very well.","date":"October 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGNLYWRIPXSNDKXOORHXJZA33TNA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jason Mitton</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great product, case is great and tough.","date":"November 17, 2017","author":{"name":"Jason Mitton","link":"/gp/profile/amzn1.account.AGNLYWRIPXSNDKXOORHXJZA33TNA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Four Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Just got this case for my new Pixel 2.Like all my other phones over the years, Always my favorite case!","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGUVGOGICL2IQMNNHMJF37L5FXMQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Trevor J Thurman</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case, works well and serves it's purpose.","date":"November 14, 2017","author":{"name":"Trevor J Thurman","link":"/gp/profile/amzn1.account.AGUVGOGICL2IQMNNHMJF37L5FXMQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love it! It's sleek and grip is amazing. Would recommend buying if you like a sturdy minimalistic case","date":"December 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great product. All around good experience.","date":"December 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"fits perfect.  Easy to install.  Shipped promptly.  Very happy with the experience.","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEVJIRJRSGVJ2K2JI6CREJA5MCQQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Tommy Tran</a>","link":null}},{"title":"Good","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits well and adds just the right amount of grip. Isn't hard to get out of pockets.","date":"October 29, 2017","author":{"name":"Tommy Tran","link":"/gp/profile/amzn1.account.AEVJIRJRSGVJ2K2JI6CREJA5MCQQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Nice feel. Adds grip And very protective.","date":"October 31, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHL5CISWLLTD2OHFNAXUABOVHIUQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jay A</a>","link":null}},{"title":"Tight and Black","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect fit, simple and easy installation","date":"November 16, 2017","author":{"name":"Jay A","link":"/gp/profile/amzn1.account.AHL5CISWLLTD2OHFNAXUABOVHIUQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Solid case, fits well. It's probably the best you will find at this price point.","date":"November 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFY5QSI3CC2ECWXQFXJNWVPNWHVA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Henry Bodette</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Best case for a phone I have ever owned. Flexible yet still feels very very rugged and sturdy.","date":"December 3, 2017","author":{"name":"Henry Bodette","link":"/gp/profile/amzn1.account.AFY5QSI3CC2ECWXQFXJNWVPNWHVA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"It's probably the best you will find at this price point","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits the phone well. Fully satisfied.","date":"November 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFFKZGYGVKQ3S3QO5KCERRYJ5VPA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Steven G. McElveen</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits well, has a nice feel to it, buttons on the side work well. Definately recommend","date":"December 4, 2017","author":{"name":"Steven G. McElveen","link":"/gp/profile/amzn1.account.AFFKZGYGVKQ3S3QO5KCERRYJ5VPA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect.  Sturdy enough to do the job without adding a ton of bulk.","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Slim, sturdy, easy to use case. Fits my Pixel 2 perfectly. What more do you need?","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Perfect. Sturdy enough to do the job without adding ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It did what I expected and the cost was on target, or lower than the competition!","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHXMWSJKHLZJ5CLNFP6KTO3RGOOA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Leroy Marshall</a>","link":null}},{"title":"sturdy, easy to use case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"it is looking nice","date":"December 5, 2017","author":{"name":"Leroy Marshall","link":"/gp/profile/amzn1.account.AHXMWSJKHLZJ5CLNFP6KTO3RGOOA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great buy","stars":"a-icon a-icon-star a-star-5 review-rating","body":"best pixel 2 case","date":"November 8, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFUET5UTNQTAXX3VAFRMVZDJSMDA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jordan Brown</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"love this product! light and feel protected!","date":"November 13, 2017","author":{"name":"Jordan Brown","link":"/gp/profile/amzn1.account.AFUET5UTNQTAXX3VAFRMVZDJSMDA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love the case.","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHKVOOBIWRX7QNFWPNYUEJMHK2MA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ed</a>","link":null}},{"title":"buy it now!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Looks great on pixel 2. Fits perfectly. Fast shipping.","date":"November 11, 2017","author":{"name":"Ed","link":"/gp/profile/amzn1.account.AHKVOOBIWRX7QNFWPNYUEJMHK2MA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect case for the Google Pixel 2. I like the design and the feel.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH3BKGXGOOQ3Q7IIT7Z7NOYWYK5Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Niranjan Yadla</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect one what I exactly want!","date":"November 22, 2017","author":{"name":"Niranjan Yadla","link":"/gp/profile/amzn1.account.AH3BKGXGOOQ3Q7IIT7Z7NOYWYK5Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Solid, snug, well-fitting case, fits easily in pants pocket.","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfect and got it real quick couldn't be happier","date":"November 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"fits easily in pants pocket","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great product and arrived supper fast","date":"November 22, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF4OFSXP5Y4ULCUHCV62ASHBBKGQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Arnie Miller</a>","link":null}},{"title":"Perfect","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It's sturdy and flexible. It's pretty great.","date":"December 6, 2017","author":{"name":"Arnie Miller","link":"/gp/profile/amzn1.account.AF4OFSXP5Y4ULCUHCV62ASHBBKGQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Item fits my Pixel 2 very well. No issues.","date":"November 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEZVTRODFXGTNKPVQGQUCESUV24A/ref=cm_cr_getr_d_pdp?ie=UTF8\">Clint Chalmers</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great fit. Arrived quickly. No complaints","date":"November 19, 2017","author":{"name":"Clint Chalmers","link":"/gp/profile/amzn1.account.AEZVTRODFXGTNKPVQGQUCESUV24A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Awesome product, good quality, no issues","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHEGP3IQHZ7GYGLPMCRUUQCGFJTA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Cancey</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Easy to install and fit perfectly.","date":"November 30, 2017","author":{"name":"Cancey","link":"/gp/profile/amzn1.account.AHEGP3IQHZ7GYGLPMCRUUQCGFJTA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, no issues at all.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGOXGAQYSN2MNVS4OHH5HBXGZNHQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"Excellent case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Durable and precise measurements","date":"December 3, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AGOXGAQYSN2MNVS4OHH5HBXGZNHQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfect.","date":"November 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Nice slim case, fits well","date":"December 7, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect fit","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEQT2YTR362WXW5QQT7BRRPH5SXA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jim</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"5 star","date":"November 29, 2017","author":{"name":"Jim","link":"/gp/profile/amzn1.account.AEQT2YTR362WXW5QQT7BRRPH5SXA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I would give five stars, but the case has a hole where there does not apparently need to be one. Its the rectangular hole on the back of the case just below the led light.<br><br>UPDATE:  I contacted Spigen about this and they informed me that there is indeed something there, it's just hard to see. Some kind of laser for the flash.","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE4T5ODHQ7DZRRHXYJ5AWHI3ASOA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jim</a>","link":null}},{"title":"Great case cheap","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The Pixel 2 is the only phone I felt like purchasing a case out of the box as the phone feels very delicate and light compared to other phones I own in the past. Normally I would purchase a case a few months after owning a phone or when cases go on sale, but decided to make an exception this time around.<br><br>Build quality of the case is very good. Phones feels more sturdier with the case on without adding much bulk/weight.<br><br>I like the textured back. Makes for a better grip on the phone.<br><br>Case is very easy to slip on-and-off like a glove. Some pressure is required so it's not going to slip off on its own<br><br>All cutouts from the USB Type-C, Microphones to light sensors on the phone are on point<br><br>Love the slope on the finger print cutout. Your finger gravitates to it very naturally and way better than the flat deign without the case, where i tend to miss press maybe 1/15 times having to re-position my hand and/or fingers<br><br>Carbon fiber is okay. Great visual appeal. Not sure why they added on both the top and bottom of the phone. Would be cool if it were only around the camera, but guess they want to keep the phone design more symmetrical?<br><br>I like how the power and volume buttons are flush with the case, so not additional grim or dust can enter. Wish there was a nub or dot on one of the buttons to get a better indicator when picking up the phone and blind pressing. This is also an issue without the case, so not going to dock it on that.<br><br>Front of the case is raised slightly, so when you have the screen down it doesn't rub against the flat surface.<br><br>Active edge, squeeze feature works with case on. Didn't have to adjust the sensitivity in the setting from what I used before<br><br>Overall, very impressed with the case as it provides better functionality and protection","date":"October 27, 2017","author":{"name":"Jim","link":"/gp/profile/amzn1.account.AE4T5ODHQ7DZRRHXYJ5AWHI3ASOA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Extra hole on back?","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I purchased both Spigen's \"Thin Fit\" and \"Rugged Armor\" cases.  Here is my comparison:<br><br>The \"Thin Fit\" is definitely more streamlined and little less bulk than the \"Rugged Armor\", but is seems to me the \"Rugged Armor\" would provide better protection.<br><br>The \"Thin Fit\" has a smoother finish feel, while the \"Rugged Armor\" has a little more grip.<br><br>Since the \"Rugged Armor\" is more rubbery, it is much easier to remove from the phone after installed.<br><br>The finger print scanner feels like a good fit on both products.<br><br>The power and volume buttons are exposed through a cut-out on the \"Thin Fit\", while the \"Rugged Armor\" completely covers these buttons.<br><br>Overall, the \"Thin Fit\" is a little more slender and slicker, but I will most like stick with the \"\"Rugged Armor\" for the better protection.","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF7NP2HUACQG7XA5M5D54KE57W2A/ref=cm_cr_getr_d_pdp?ie=UTF8\">chris evon</a>","link":null}},{"title":"Phone Feels More Secure","stars":"a-icon a-icon-star a-star-1 review-rating","body":"Instantly cracked my $40 tempered 3D glass screen protector when inserted per instructions. Will be returning. I am NOT a happy camper.","date":"November 15, 2017","author":{"name":"chris evon","link":"/gp/profile/amzn1.account.AF7NP2HUACQG7XA5M5D54KE57W2A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"\"Rugged Armor\" vs \"Thin Fit\"","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I picked this case up for my new Pixel 2 as a direct result of the horrific battering that the Slim Armor variant for the Nexus 5 has protected my wife's phone from.  My wife tends to be a clumsy person, and as a result her phone has taken some amazing trips through the air, against which the Slim Armor has been entirely and totally successful in preventing damage.<br><br>This case looks to be equally superbly made, and the carbon fiber inserts in the back add a classy touch.  It fits the phone perfectly (as I would expect from Spigen) and the buttons cycle as easily as without the case.  Both top and bottom microphone ports are nice and centered in the provided holes, and the charger jack is unobstructed for even large-tipped cables with plenty of cut-away distance.  The squeeze-to-activate for Assistant still works flawlessly, and the cutout for the fingerprint reader neatly and comfortably guides your finger into the proper position to hit the reader every time.  The bulk of the case seems about right for a light-to-mid protective one.  Not enough that it stuffs out of my pocket, but enough to add just a touch of bulk and grip, and \"feel\" protective.<br><br>I will follow up with this review in a few months as I've put some miles on the case, but the initial impression is one of high quality and perfect fit.","date":"December 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHBENNPOKHTGLXYP2A5DSZBEF4WA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"I am NOT a happy camper.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I've had Spigen's Rugged Armor cases on my past three phones, so I had high expectations for the new Pixel 2 Rugged Armor and pre-ordered almost immediately after placing my phone order with Google.  Thankfully this iteration doesn't disappoint.<br><br>The quality of the case material is excellent and adds a nice level of grip to the sides of the phone, and all ports and sensors have ample clearance/cutouts.  The corners have the same shock protection design found in other Rugged Armor cases - a welcome feature, as I've dropped phones in Rugged Armor cases on every conceivable surface and never once had damage to the phone itself.  The \"active edge\" squeeze functionality of the Pixel 2 works perfectly with the case on as well; I'd even argue it's easier to activate now, as the case makes the phone much easier to grip and adds a nice chunky edge to squeeze!  The case doesn't add much bulk at all.<br><br>For the price, you can't beat the quality and protection provided by the Rugged Armor.  I'll continue to buy these cases as long as Spigen keeps making them!","date":"October 25, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AHBENNPOKHTGLXYP2A5DSZBEF4WA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Honestly, I only bought this case to protect my phone until the Spigen Neo Hybrid got to me (it had a projected arrival date a month or more from the time I purchased my phone, and that was too risky for me).  I didn't expect much from it, so I was very pleasantly surprised, as it has exceeded my expectations.  I'm actually keeping this case and returning the Neo Hybrid (nice case, but slippery, squirts out of your hands like a bar of soap).  Now, this probably isn't the most heavy-duty protective case on the market, but I've been extremely pleased with it, especially for the price!  For a slim case I'd say it's VERY protective.  The cut-outs are perfectly aligned, active-edge works perfectly, buttons are easy to press, material of the case is firm enough to feel like phone is protected, but not stiff/brittle, the slim profile is great, and the raised lip around the screen equals YAY!  I'm still undecided if I will get another, more protective case (my last phone had the top-of-the-line Otterbox so I'm used to feeling EXTRA secure) but I really am more than pleased with this super slim Rugged Armor.","date":"November 17, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Very happy with this case.<br>- I measured it adding 3mm to thickness of phone (with ruler, not calipers) - from 8mm without case to 11mm with case.<br>- Feels like it adds less thickness than similar cases I've had in the past.<br>- Material feels resilient enough to protect phone from most drops/dings without adding the bulk of an Otter Box type case.<br>- The cutout on back for fingerprint reader makes it easier for finger to find the reader.<br>- Exterior texture provides good grip on phone without excess drag removing from pocket<br>- All phone buttons work and feel good with case: squeezable side, power and volume buttons.<br>- Button depresses have solid, definitive feel and little or no grit.<br>- There is also a small raised lip to protect the screen, the camera lens is recessed (standard on all cases now I think).<br>- I personally like the matte black design and the small carbon fiber strips at the top or bottom.","date":"October 31, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Far exceeded my expectations--extremely pleased","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is exactly the kind of case I look for for my phones. It provides a very decent level of protection while not adding the kind of bulk that turns it into a brick. There is a tiny raised ridge that runs around the front of the phone protecting the screen adequately. The back is a good blend of protection, grip and style. The \"carbon fibre\" design looks good.Definitely better than it sounds. The finger print reader is quite heavily recessed, giving you a decent idea of the protection it offers. If you have enormous fingers I suppose that might be a problem. I had a very similar case on my last phone and it protected it from a couple of minor drops and a couple of bangs against wall corners while being carried. I expect this will provide equally good protection based on my first few days with it. I don't use a screen protector as I've not found one necessary with glass improvements and this kind of raised-edge protection. If you're looking for a tank-like case this probably isn't for you. If you're looking a for great protection at a great price with minimal bulk addition to the phone, you won't find a much better case than this. Highly recommended.","date":"October 28, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHW6OAU5PAPFDD534FRMTAYT4ZUA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Kathryn</a>","link":null}},{"title":"Nice and slim case, provides adequate protection and nice feel in hand","stars":"a-icon a-icon-star a-star-2 review-rating","body":"Fits perfectly, looks and feels great.  However, my screen cracked at it's first fall with this case.  It's was a 3ft fall, landed face down.  This cover did not provide a barrier for the screen.<br><br> I've had numerous similar drops with previous phones and a Commuter series OtterBox with no issues.  Unfortunately no OtterBox is available for the regular Pixel 2.  Turns out this is not a good alternative.","date":"November 5, 2017","author":{"name":"Kathryn","link":"/gp/profile/amzn1.account.AHW6OAU5PAPFDD534FRMTAYT4ZUA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Perfect blend of protection/minimal bulk","stars":"a-icon a-icon-star a-star-4 review-rating","body":"I decided for once to get a case for my phone before I had dropped the phone and dented it or scratched the paint or anything, but when I was ready to order one most cases were unavailable or didn't have reviews. I have this case on my Nexus 6P, though, and I had good experiences with it there so I decided to take the chance with this one. It seems like a pretty solid case that should do well to protect the phone. All the ports are there, and there is ample space for them, so no blockage issues. I have no issues with activating Active Edge (the squeeze feature) with the case on, and if anything it's probably a little easier to do since there's a little more grip and a material to squeeze. The fingerprint port continues to feel like an improvement over the bare phone since it guides you to the sensor and makes it less vague where the sensor is, though it does make it a little bit harder to use the fingerprint sensor swipe (for pulling down the notifications/quick access). There is a raised lip for the front so if you put the phone face down, the glass isn't going to touch the surface, which is really nice.<br><br>There are a few things to be aware of with the case though. While the ports have ample space, they are apparently aligned slightly off-center from what they're allowing access for. The bottom microphone, for example, is right about on the top of the port (the microphone hole isn't blocked at all though), rather than centered, and the top microphone has a similar but less pronounced offset. Likewise, the port for the fingerprint sensor is slightly offset low and left, so top right edge of the sensor is about equal with the port while there's a bit of excess space beyond the sensor to the bottom left. None of these affect performance, so it's more of a small detail that just irritates a person who likes things to be centered, level, etc. The buttons for the case work fine, though they're not fully enclosed; there are small gaps above and below (or to the sides, depending on how you're looking at it). I tell myself they're for helping water drain or something, but what it seems most likely is that they'll allow some dust and small particles in there. I also wish the separation of the volume up and volume down buttons was a little more defined. I hate volume rockers and much prefer individual buttons, so I like this case because it essentially turns a rocker into buttons, but they're separated and individually defined a little better on my 6P case compared to this one. The carbon fibre inserts look nice, but they're also recessed/the majority of the case bulges out some. This is actually kind of good because it means if you put the phone down on its back, the camera isn't touching the surface (assuming a hard, flat surface like a desk) at all, so you're less likely to accidentally scratch the glass. However, this also seems like the case adds a little more bulk than is maybe necessary (not bad for me since I like my phones to feel substantial). And finally, the case is pretty snug, which isn't necessarily bad but it does mean the phone is a little bit tough to get into the case, and I worry that I might accidentally scratch the phone trying to get it in or out.<br><br>I did order a tempered glass screen protector but it's not here yet, so I don't know how well the case will work with that, but if you don't have a screen protector on, it's a really solid case. There are enough nitpicks for me to give it a 4 instead of 5 star rating, but nothing so bad that I wouldn't highly recommend the case.","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGJ22ON7UKXMK54NZ5SOZCSGKIFA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Sean</a>","link":null}},{"title":"Good look and fit, poor protection for drops.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I normally hate cases, but after buying Nexus phones for years this Pixel 2 is by far the most I've spent on a phone in a while, so I wanted to keep it safe. I wanted something that would provide ample protection but not bulk up the phone too much, and looking through Spigen's offerings I thought that this one would be the one for me.<br><br>Turned out that this case is exactly what I wanted - it's lightweight and fits perfectly, but it's thick enough to actually cushion falls, and has a bit of a lip over the edge of the screen so that the corners won't ever hit the ground. The material is like a hard rubber, it's not clingy/sticky like some cheap rubber cases are, but it's not brittle plastic either. The buttons are well made and feel great. I'm not crazy about the random carbon fiber accent but it's reasonable IMO. You do get some dust collecting around the edges but I think that's true for any case. Active Edge still works, but you may need to adjust the sensitivity - mine has always been a little finicky if I use my palm, though it's better if I use a finger on each side, but the case doesn't seem to make it noticeably worse.<br><br>Overall, great case for the price (and in general)! Cases in this price range are usually mushy and weird but this one is perfect.","date":"November 1, 2017","author":{"name":"Sean","link":"/gp/profile/amzn1.account.AGJ22ON7UKXMK54NZ5SOZCSGKIFA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case with a few design quirks","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is a fantastic case. It's soft rubber so it slides easily in/out of my pocket.It fits the phone snugly. It's also really slim, doesn't add weight or bulk to the phone.<br><br>THE BEST FEATURE: the button covers for the volume control actually improve the volume controls because you can feel the notch where the up/down keys are. I wish Google cut a notch on the volume keys. I have a hard time with it without the case.<br><br>The screen-side cover pushes up against my screen protector creating air bubbles. I have to just use my finger nail to move the cover over the screen protector. It's not a big deal though.<br><br>I had a Spigen cover for my Nexus 5x so I had to get this one for my Pixel 2. Best cover IMO!","date":"November 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG2KE43XUAANN365EZLX3D263IAQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">NibberJammies</a>","link":null}},{"title":"I normally hate cases, but after buying Nexus phones for years ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love it! Buttons are so clicky. Seriously! I'm able to double click power button so easily to get into camera. Number 1 reason I went with a pixel 2 (quick camera) just got quicker with the clicky button! Case I'm reviewing this relative to is the thin live case (which looked great but felt bad in most ways)<br><br>Pros:<br>Looks good and sleek<br>Feels good<br>Fingerprint sensor cutout feels really good and allows gliding on the sensor to pull down notification shade without issues<br>Buttons! So clicky, very satisfying feel!<br>Matte finish, love it<br>Feels very protective without adding too much size<br>Very good fit<br>Squeezey works fine<br><br>Cons:<br>Very black slab-ish, not a lot of flair, carbon fiber highlights are nice though.<br>Case could be more grippy, but compared to live case it's super grippy","date":"November 7, 2017","author":{"name":"NibberJammies","link":"/gp/profile/amzn1.account.AG2KE43XUAANN365EZLX3D263IAQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"This is a fantastic case. It's soft rubber so it slides easily ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits perfectly on the new Pixel 2 (5 inch). I just got the phone in today, and it couldn't be a better fit. The case feels durable and sturdy. This phone is great, but i immediately noticed it was succetable to scratches and quick wear and tear. This case will definitely prolong the integrity and look of the new Pixel. Well done Spigen.","date":"October 20, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHJMS7U6Q3BCFPNGJXRAKBIXKYVA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Richard T</a>","link":null}},{"title":"Buttons so clicky, double click to camera never felt so quick","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Nice case. Goes on easily and the holes line up perfectly, it also comes off easily. One thing I've noticed is it does collect a lot of dust around the edges, which other have said. I didn't think I would notice but you can definitely see dust collecting, easy to wipe away but it's odd that it happens. I can also say that it does protect the phone. I dropped my phone on the tile floor while putting it in my pocket and the phone took the fall without issue. That's the most important thing and it stood up to being dropped.","date":"November 22, 2017","author":{"name":"Richard T","link":"/gp/profile/amzn1.account.AHJMS7U6Q3BCFPNGJXRAKBIXKYVA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Looks like its doing its job well and protecting my phone. Most phones these days are too big to fit comfortably in my small palms (or tiny pockets in women's jeans) and I regularly drop them. I like the rubbery grip on this case and the fact that it covers the phone on all the edges. Obviously this takes away from the overall look of the phone but I am willing to sacrifice that for safety. I am not a big fan of the carbon fiber design features on the back and would have preferred plain design throughout.","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits well, very light weigh, clean and understand look. . I did have to increase the squeeze pressure to activate Google assistant to it's highest,  the extra grip make it easier to activate.<br><br>Only ding which doesn't merit reducing a star, opposite end of the bottom mic, is a small divot, likely where the mold injects.","date":"November 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Good protection, not very elegant looking","stars":"a-icon a-icon-star a-star-4 review-rating","body":"It's a nice thin and seemingly durable case. I highly doubt the military grade drop test part of the advertising, but whatever. I'm all about bumper cases - thin things that just let me lay a phone down flat on a table without touching the screen and giving cover for corners if a phone falls to the ground.<br><br>This seems to mostly do that very well with one exception - it collects a lot of dust in places. I must note that I do not have a screen protector as I'm careful with my devices and never liked the feel. I get a lot of dust gathering along the top of the phone, as well as the small camera sensor cutout beneath the flash.<br><br>I'm really just worried about the camera sensors beneath the flash. I think cutting out the tiny sliver of case between the flash and sensors might help or there seems to be quite a few similar alternative cases made that way that could avoid the issue.","date":"November 16, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG57SYHRZ4EOGPK2IWVSHOIY6A4Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">AD</a>","link":null}},{"title":"Fits well, very light weigh, clean and understand ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case is light and yet very well made. It fits snugly and offers a great deal of protection as far as I can tell. I feel confident that I could drop my phone and it would be just fine!<br>The case lines up perfectly so it doesn't obstruct the fingerprint sensor or camera. The case also does not obstruct the Google Assistant \"Squeezey-sides\" function. I use this function a lot and have not had an issue regardless of the case covering the phone. Definitely worth the price :)","date":"November 6, 2017","author":{"name":"AD","link":"/gp/profile/amzn1.account.AG57SYHRZ4EOGPK2IWVSHOIY6A4Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Sturdy, slim fitting dust collector","stars":"a-icon a-icon-star a-star-4 review-rating","body":"I received this case prior to receiving the phone, so I'll update once I slide the device into the case.<br><br>Spigen products are known for being precision fit and of high quality.  This TPU case seems in line with that reputation.<br><br>I do wish I had known that there were \"slots\" on the long sides of the volume and power buttons and that the buttons are not *fully* covered.  I hate that since I pocket carry and my phone is prone to picking up pocket lint.","date":"October 12, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHAFJAGKOCNXG2VALEBNENTM5TLQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ben</a>","link":null}},{"title":"Great case! Lightweight and protective","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is an amazing case by Spigen. The cutouts are precise, the matte finish is satisfying to hold and blends right in with the rest of the phone. The carbon fiber accents are appealing and the bottom indentation is a good place to rest your pinky finger when using the phone one-handed. I only wish the front lip was slightly bigger but it would add more bulk to the phone. As it is now this is one of the slimmest cases you can find, while still providing more protection than sub-10$ TPU cases.","date":"November 14, 2017","author":{"name":"Ben","link":"/gp/profile/amzn1.account.AHAFJAGKOCNXG2VALEBNENTM5TLQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Spigen Rugged Armor for the Pixel 2 -- a quality and precision cut case that should provide great protection!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This is the perfect case for me and my Pixel 2. It feels great in my hand, is very sexy and sleek, and definitely protects my phone well. It fits quite snugly and the buttons still work extremely well. I honestly don't feel comfortable handling my Pixel 2 without it. The case also makes it easier to grip the phone while using the \"squeeze\" function and the fingerprint sensor on the back.","date":"November 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEOAC6Q5YFNX5JNUQPXTWUWKI3BQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">J. Malinowski</a>","link":null}},{"title":"A perfect case","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Very good case for the Pixel 2 (2017). Fits well and the buttons are easy to access and use.  Also, for those wondering, the active edge feature (squeeze to activate the assistant) works well with this case. I've had no issues and don't have to squeeze extra hard.<br><br>The case keeps the screen from touching the table when you set it down, and does the same for the back side camera.  Seems like this case will protect the phone well.  Would buy it again if I had a second Pixel 2.","date":"October 30, 2017","author":{"name":"J. Malinowski","link":"/gp/profile/amzn1.account.AEOAC6Q5YFNX5JNUQPXTWUWKI3BQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Perfect Case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I've not used a phone case before because some are so bulky. This case fits my Pixel 2 perfectly and you can barely tell it's there. The buttons seem appropriately responsive despite being covered.<br><br>Another concern was that it would pick up lint from my pants pocket. That doesn't happen.<br><br>Does it protect my phone from a drop? I hope to never find out!","date":"November 14, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AET36I6VGKKF35PEFFLELDT6T3AQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Kaorikaze</a>","link":null}},{"title":"Very good case for the Pixel 2 (2017)","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The Rugged Armor case for the Pixel 2 is a perfect fit, looks/feels great and allows for easy use of all the Pixel 2 functions.  The case fit easily, yet snug, around the Pixel 2 and I was very impressed with the quality/look of the case on the phone.<br><br>Function: The case is a perfect fit for the power button and the volume control buttons.  It feels to me like I must use slightly more pressure, but it is certainly not an issue and, as I think about it, may even be a positive since the buttons have less chance of being inadvertently pressed.  Also, the \"Active Edge\" function works fine; maybe slightly more pressure is needed, but not a bad thing in my opinion.  I've taken a number of pictures with the case on and have not noticed any impact to the photos.  There is an imperceptible variance (nit-picking here) with the cut out for the fingerprint sensor; however, it has no impact on the function of that sensor (use it all the time).  I use my phone to stream music while working out and this case allows me to slide it into my pockets easily.<br><br>Protection: I have no intention of conducting any drop tests, so I'll update when/if that ever happens.  Given my history, unfortunately, I'll have some experience soon enough. In the meantime, the case feels like it adds sufficient protection from bumps, scrapes and drops.  The raised edges provides protection to the screen while also protecting the camera face.<br><br>Looks:  Although this is really a personal preference on what one likes, having the black case on the black phone, I think it looks great.  The back is smooth, with the carbon fiber and gloss detailing at the top and bottom of the back giving it a rich look.","date":"November 6, 2017","author":{"name":"Kaorikaze","link":"/gp/profile/amzn1.account.AET36I6VGKKF35PEFFLELDT6T3AQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I was a little concerned, going from an OtterBox with an older iPhone to a new case with a brand new phone. After the heft of the OtterBox, this case seemed worryingly thin when I opened it and put it on, but I've dropped the phone a few times now, and there's no damage or problems with the phone, so my concerns are gone.","date":"December 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great fit and provides a good grip. I like the fact that when I'm pushing buttons, I'm pressing on the casing and not on the phone's buttons themselves.<br>I bought this case with the iSTOYO screen protector. I wouldn't use this protective \"film\" with this case. The case fits really well, and it bunches up the screen protector. Maybe a glass screen protector would work better than one comprised of film.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Looks good, does the job well.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case works as advertised. It is smooth on the back side and can slide around on surfaces which i could not tell from any review.  It's not a bad thing but I guess I expected it to have more friction so surfaces. All the cutouts fit perfectly so there's no problem there. It has very little to the bulk of the phone.  Active edge feature works great with case on.","date":"November 23, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGZ7FTKQJFS7PUG5JO6L4CG7J2RA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Lyssandra</a>","link":null}},{"title":"Great fit and provides a good grip","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly with precision; squeeze function works flawlessly; all around drop protection with no added bulk or clumsiness. I love this case - so far it's made for an even better experience with my new Pixel 2!<br><br>Update! (12/5/17): Alright, so. I have accidentally dropped my Pixel 2 with this case at least twice, onto coarse stone concrete... absolutely no worries whatsoever. In fact, I have removed the case for routine cleaning and have noticed that, despite it's wonderfully solid, minimalist, aluminum/glass design, I prefer using my phone with this case! You get just the right amount of grip/surface tension with this case, without feeling tacky, flimsy, or of poor quality.","date":"December 2, 2017","author":{"name":"Lyssandra","link":"/gp/profile/amzn1.account.AGZ7FTKQJFS7PUG5JO6L4CG7J2RA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Perfect fit.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits my Pixel 2 great and seems to provide a decent amount of protection without a lot of added bulk. I don't tend to drop by phone, so I haven't really tested it out. However, I like the way the case feels in my hand, and makes it easier to grip the phone while using it. The case is well made and does not inhibit the use of any of the phone's features. It also does not get in the way of the screen protector (film, not glass) that I have on the phone. This is a great case, especially for the price!","date":"November 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEBPM23WT3FKGSW7PJ7KLECWPC2A/ref=cm_cr_getr_d_pdp?ie=UTF8\">greatlegs</a>","link":null}},{"title":"Just buy it!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I bought this case for my 14 year old's new pixel 2 phone. He worked for 6 months to earn the money to buy himself a new phone. I let him pick out the case. The case was ordered on a Sunday morning and delivered on Monday afternoon. He opened the package, put the case on his phone and within minutes dropped the phone on the driveway. The phone survived the 3 foot drop on to concrete without a scratch. It was a great teaching moment on the importance of protecting valuables.","date":"November 6, 2017","author":{"name":"greatlegs","link":"/gp/profile/amzn1.account.AEBPM23WT3FKGSW7PJ7KLECWPC2A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Like it a lot - seems to provide good protection without adding too much bulk to the phone.<br>all buttons work well through the case &amp; fingerprint reader still works well.<br>Just got it, so I will report back at a later date, after I have had it for a while, but for now I am very happy for $13.","date":"December 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHIKNRTHP6ELNX5NH6LEC6G64XTA/ref=cm_cr_getr_d_pdp?ie=UTF8\">dnelson</a>","link":null}},{"title":"The case saved the phone within minutes of being installed.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"needed an inexpensive case that didn't add a lot of bulk and protected the phone from drops and falls. This was exactly that. Nothing special or flashy and exactly as described. Would recommend if you don't like putting expensive ultra box cases on your phone that pretty much hide the entire thing. Sure those add more protection but I just don't like those. This works just fine for what I wanted and needed. Would like to have seen more colors since my white phone looks pretty much completely black both sides now but it's got a good grip and I don't feel like I'm going to drop it every time I use it.","date":"October 28, 2017","author":{"name":"dnelson","link":"/gp/profile/amzn1.account.AHIKNRTHP6ELNX5NH6LEC6G64XTA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Good value - appears to offer fair protection with minimal bulk","stars":"a-icon a-icon-star a-star-1 review-rating","body":"Do not get this case if you have screen protector. I already went through 2 protectors and not junk ones either and neither lasted even a week. The edge of the case pushes up on the edges of the protector and I broke my glass protector today.","date":"November 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHSZFNFLRS34U6PMOR7QGZQEKXMA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Jeremy Cooper</a>","link":null}},{"title":"exactly what I wanted","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this brand. This particular case fits like a glove.very comparable to the other spigen case I use (the clear one in the pic) in terms of fit. This company does an amazing job making sure the cutouts are precise and the buttons are easy to press. I'm very satisfied.","date":"November 29, 2017","author":{"name":"Jeremy Cooper","link":"/gp/profile/amzn1.account.AHSZFNFLRS34U6PMOR7QGZQEKXMA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I typically like a thicker case, but I decided to try something a little slimmer this time.  The case itself is a breeze to install and adds just the right amount of thickness to my Pixel 2 XL.  I tend to place my phones face down which you can do with this case since it's raised a bit over the screen.  This ensures that the screen itself is not touching the surface that your phone is sitting on.  Assuming of course that it's a flat surface.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I really like this case. It's got a very minimalist design which is very much my taste. It's almost like the phone is not even in a case, except that it has a slightly grippy texture (but not so grippy that it won't easily slip into your pocket). The case also seems to be immune to lint, unlike my previous case that was more rubbery. Phone slipped very easily into the case yet seems to fit nice and snug.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"I like it","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this case, fits perfectly with my Pixel 2 and everything works as expected.  I also like the look and feel of the case.  It has enough grip so it's not slippery when holding it but it's NOT too grippy because it easily slides into my pocket.  Active edge works well with this case and the buttons are still clicky.  No issues with pictures or videos.  It lays flat and has raised edges on the front to protect the screen.  I wished it had a sturdy kickstand like some other more expensive cases from Spigen but other than that I love this case!","date":"November 10, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHFTUEYI3XIWS6VAFYQ6OZWUTCOQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Mike B.</a>","link":null}},{"title":"Nice minimalist style","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I am extremely happy with this case for my Pixel 2. The fit is perfect - it feels sturdy, but it's thin enough that it doesn't make the phone feel huge or interfere with the buttons or the squeeze feature. The cutout for the fingerprint sensor has a beveled edge that makes it accessible and comfortable to use.","date":"November 13, 2017","author":{"name":"Mike B.","link":"/gp/profile/amzn1.account.AHFTUEYI3XIWS6VAFYQ6OZWUTCOQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Highly recommend this case!  Quality product!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I've been using Spigen cases for my last few phones, and have enjoyed all of them. This case is no exception. This one is slim, but still solid. Most importantly, the button response is great; no mush or loss of contact. Highly recommended.","date":"November 8, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEOPYTWK3CW5PXVVZUWW3EA7CYRA/ref=cm_cr_getr_d_pdp?ie=UTF8\">kclubta1</a>","link":null}},{"title":"Fantastic case!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"I like the case, as it has a good feel to it and looks great. Does not make the phone too bulky.<br><br>The one thing I didn't like is that it doesn't work well with a tempered glass protector. I couldn't get the lip of the case uniformily around the tempered glass. Definitely not after considering a magnet for mounting the phone in my car. Not sure if I'm going to send it back yet.","date":"December 2, 2017","author":{"name":"kclubta1","link":"/gp/profile/amzn1.account.AEOPYTWK3CW5PXVVZUWW3EA7CYRA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Another great Spigen case.","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Was looking for a thin case with good protection for my new Pixel 2 and this one fit the bill perfectly. I didn't give it a full 5 stars as the back is still really slick and can make holding the phone with one hand precarious. It would have been great to have a slightly more grippy surface on the back. Overall though I would highly recommend this case, its one of the best for the pixel 2 if you don't want to spend $40... cough cough google...","date":"November 8, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE7LGUKN36Z3DFL4XFXLEREM4DIA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Matthew Ritzman</a>","link":null}},{"title":"Great case, but watch out if you use tempered glass protector.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I previously had the top brand protective case on my old phone. The case was $39 four years ago. This new case is almost identical to that one. The fit, finish, and quality are astounding. The level of protection is comparable to the big name brand slim case that's 4 times the price.It adds virtually no bulk to the phone, is very cushioned, and has a grip texture but easily slides in and out of your pocket. And, the carbon fiber insets give it a high end look I highly recommend this case for the Pixel 2!","date":"November 25, 2017","author":{"name":"Matthew Ritzman","link":"/gp/profile/amzn1.account.AE7LGUKN36Z3DFL4XFXLEREM4DIA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great case, but with one flaw","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits really good.  Turns out some people complain that the Pixel 2 volume buttons are very tough when pursuing then (I'm one of those). Having the case alleviates the issue just a tad.<br><br> Having the fingerprint sensor recessed into the case was weird at the beginning, but after a few minutes I didn't notice that anymore.","date":"November 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHYKZ3FMIHFCOTLQWEKOJ6JBA7QA/ref=cm_cr_getr_d_pdp?ie=UTF8\">C. Mecklenborg</a>","link":null}},{"title":"Excellent Pixel 2 Case at excellent Price","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Delivered quickly, sturdy case, and nice look. I've used a Spigen case for my last two phones and recently upgraded to the Pixel 2 knowing exactly which case I wanted. Spigen is a very well known brand that makes some great cases. I like that the case is sturdy without becoming bulky (like many of the Otter Box cases). I have dropped my previous phone a handful of times and the case has protected it against each fall. I'm confident that this case will work exactly the same way.","date":"November 29, 2017","author":{"name":"C. Mecklenborg","link":"/gp/profile/amzn1.account.AHYKZ3FMIHFCOTLQWEKOJ6JBA7QA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I purchased this product for my father's Pixel 2. His feed back was extremely positive. He came from an LG G4 and switching to a Pixel 2 was a huge upgrade.  Adding this case was the cherry on top.<br><br>When equipped, the feel in hand is very solid and great to the touch. The material does not make the device slippery at all. My father said that the carbon fiber is a very nice design and make's the phone look \"tactical\".<br><br>I have been a long time customer of Spigen and expect no less from them.  Great product!","date":"October 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Nice case at a reasonable price. My only issue with it is that it doesn't have a magnet in the cover to trigger the phone to turn the screen off. Most wallet-style cases have this feature, but it's missing here.","date":"November 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Spigen back at it again with quality cases!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I have never had a problem with my spigen cases.  This one fit way better then the knockoff i bought when i my phone was a pre-sale.  Nice cut lines and all the mics, camera and buttons all line up.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHI44PPRAGAXYCIMNHQNVLCAJQ4Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">Hans</a>","link":null}},{"title":"Nice case at a reasonable price","stars":"a-icon a-icon-star a-star-4 review-rating","body":"I just put this case on my phone and I will say that I like the fit and the looks. It makes my phone easier to hold and use. It still allows you to squeeze the phone and activate your Google Assistant and the phone still functions well. The reason why I did four stars is I broke two glass screen protectors trying to use this case. I don't know if it was because of the case or the protectors.","date":"December 1, 2017","author":{"name":"Hans","link":"/gp/profile/amzn1.account.AHI44PPRAGAXYCIMNHQNVLCAJQ4Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great fit case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Nice fit, easy to put the case on, and all the features of the phone work including: fingerprint readier, squeeze touch, camera, etc.  Has a nice light feel and doesn't add bulk to the phone.","date":"November 16, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGPTUW6THCA7ZDXGEHA7FZUYSZIQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Richard Freedman</a>","link":null}},{"title":"It fits and looks great!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Struggled to find a decent case for the brand new Pixel 2, this case is impressive and fits absolutely perfect. Seems sturdy, will likely protect from reasonable drops. Camera is protected by a raised lip, similar protection on the front of the case for the screen. I'll be ordering a screen protector as well.<br><br>Great low profile case, not too grippy or slippery. Would recommend,very pleased.","date":"October 26, 2017","author":{"name":"Richard Freedman","link":"/gp/profile/amzn1.account.AGPTUW6THCA7ZDXGEHA7FZUYSZIQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Fits like a glove and works great","stars":"a-icon a-icon-star a-star-5 review-rating","body":"10/10 best case for the pixel 2, phone snaps in easily, perfect camera cutouts of flash and light sensors and fingerprint scanner<br>carbon fiber accents are a bit odd but they look better in person than i expected, for $13 my expectations have been exceeded.<br><br>Low profile design fits well in hand, feels like a premium case.<br><br>I ordered a $10 case last week that didn't fit at all from a different company. this one is def worth the extra $3 and with prime shipping it came quick!","date":"October 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGKAXOPFJ4EHCGNILSLTZKLCAFCA/ref=cm_cr_getr_d_pdp?ie=UTF8\">N S.</a>","link":null}},{"title":"Great Pixel 2 Case - Slim and Well Designed","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The quality feels excellent, material is decently grippy (did prefer feel of Incipio for previous phone), can still squeeze sides for assistant. Have yet to drop it, so we'll see how that turns out","date":"November 9, 2017","author":{"name":"N S.","link":"/gp/profile/amzn1.account.AGKAXOPFJ4EHCGNILSLTZKLCAFCA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"best case for pixel 2","stars":"a-icon a-icon-star a-star-4 review-rating","body":"This is my third case by Spigen and they have all been fantastic. It's slim, it's comfortable, it isn't the sticky kind of tpu/rubber that makes getting your phone out of your pocket a challenge. Every cut, hole, and button is exact. Only thing keeping it from being a 5/5 is that the case is more on the slippery side and can fall out of your hand more easily.","date":"October 31, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGM46D5VIMFRMI5N373IPH2JAP5A/ref=cm_cr_getr_d_pdp?ie=UTF8\">shar</a>","link":null}},{"title":"Feels well-made, fits","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fit perfectly for my new Pixel 2. Feel good and not too heavy.<br>It arrived before I got my phone from Google even with it's expedited shipping (FedEx doesn't deliver on Sunday but Amazon does).","date":"November 21, 2017","author":{"name":"shar","link":"/gp/profile/amzn1.account.AGM46D5VIMFRMI5N373IPH2JAP5A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits my phone great.  A good style to it as well.  I have dropped the phone 3+ with a 4' drop on concrete and no screen protector and no damage on my phone has occurred on any of those drops.  Good case.","date":"November 9, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love this case. It's my go to now. I don't even bother trying others. Design is perfect and protection is good. Had the same one on my original pixel as well. Best feature I think is that it removes the vaugeness of the fingerprint sensor.","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Fits my phone great. A good style to it as well","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I have always liked Spigen cases. I work in a wood shop and am always walking around on concrete, all day. So if I drop my phone, I need it protected pretty well, and this case does the job. It's better than an Otterbox case because it won't fall apart. You can always put a screen protector on too if that suits your fancy.","date":"November 14, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE7UUBFUXGN2W22RU2NRN3PXXBGA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Trevor S.</a>","link":null}},{"title":"Best all around case without going for the huge dual layer models.","stars":"a-icon a-icon-star a-star-4 review-rating","body":"The only issue with this case is the fit is so tight it interferes with the screen protector on the edges.  It's possible to make it work but the edges of the screen protector are always getting pulled loose.","date":"December 5, 2017","author":{"name":"Trevor S.","link":"/gp/profile/amzn1.account.AE7UUBFUXGN2W22RU2NRN3PXXBGA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Awesome case","stars":"a-icon a-icon-star a-star-3 review-rating","body":"Thinner than expected. The case is tpu so it is super flexible and soft feeling. It is not bulky. It doesn't feel like it will really hold onto the test of time.","date":"November 13, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEU5GANOE6MUF6MLDJ232QOIG2MQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">willonious</a>","link":null}},{"title":"Nice Case but...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case fits the phone well, looks good, adds very little bulk, and allows access to all inputs and controls. In fact, the fingerprint reader seems more effective with the case - I suspect the slight depth forces my finger to hit the reader in the right place more consistently. The case also makes the phone feel more secure in my hand. It's the first phone case I've used - I always thought they were clunky and ugly. This one's nice!","date":"November 4, 2017","author":{"name":"willonious","link":"/gp/profile/amzn1.account.AEU5GANOE6MUF6MLDJ232QOIG2MQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Just an Okay case.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Not as sturdy feeling as I was hoping for, but seems to offer good protection so far. Hubby wanted thinner case, so it works perfectly for his expectations","date":"November 12, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFB6OEW5HITQQULWL4DN6BAKZLEQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Uriel V.</a>","link":null}},{"title":"Great fit and comfort","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I've only had to case a few days. The Google Pixel 2 (GP2) as an user knows when you buy, its light weight and you feel like you are going to break it by breathing on it. So the case protects the glass very well with a nice carbon finish. The case fits like a glove around the phone with the matte finish giving it some extra grip ability. The functions of the phone are not impeded (camera, buttons, finger reader, and squeeze). I have not dropped it yet, (knock on wood). But looking at the hardened rubber that gives a .5 or less raise to the front from a direct face plant...I would feel ok dropping it lightly from my desk. As long as its a direct fall and not a multi strike to the ground. As a backup I have the insurance with Google.","date":"November 20, 2017","author":{"name":"Uriel V.","link":"/gp/profile/amzn1.account.AFB6OEW5HITQQULWL4DN6BAKZLEQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Not as sturdy feeling as I was hoping for","stars":"a-icon a-icon-star a-star-5 review-rating","body":"So far I've only had this case for a few days but it's served it's purpose well. The edges come up over the screen giving it a little protection if dropped screen first (even though I still would recommend a screen protector). The outline by the camera doesn't inhibit the camera in any way and the same can be said for the fingerprint scanner. It took a little to get used to using it with the case but within an hour or 2 I was already used to it. So far the phone feels easier to hold and like I'm less likely to drop it so that's good.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEUHDTN5N3ZMR2Y6EKT2QJ7WCVSQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">C Mc</a>","link":null}},{"title":"Case Review","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect case for my needs.  Good protection without too much bulk.  Had a bad corner drop from 6ft on concrete...protected phone perfectly.<br><br>Cutouts good on camera and fingerprint.<br><br>Good grip feel...not too slippery.<br><br>I bought this before the phone shipped and I'm glad I took a chance on it.","date":"October 28, 2017","author":{"name":"C Mc","link":"/gp/profile/amzn1.account.AEUHDTN5N3ZMR2Y6EKT2QJ7WCVSQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Case fits well, has a lip around the screen to protect when you place the phone facedown and a lip around the camera to protect the lens. All the cutouts align properly. Best of all, the buttons are easy to push and don't feel mushy like other cases. Very happy with this case.<br><br>The only real con with this case is the fact that the back is very smooth, so it can feel a bit slippery at times. Other than that I have no complaints and will be sticking with this case.","date":"October 31, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I don't often write reviews but I felt I needed to do this one. I have never been a fan of phone cases. They always make the phone too big and clunky and awkward and pockets. Nevertheless I needed one for this phone as it's my first phone purchase in quite some time and I'd like to keep it in good shape. The case is very streamlined and Light a carbon fiber accents look cool and overall it is impressive-looking. I had purchased a clear outer box case alongside the phone in hated it it completely ruined everything I like about the phone. This case just made my day","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Buttons feel great","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Excellent cover! It fits the phone perfect and barely makes it feel any thicker. It feels like it will protect it pretty well. This case also retains the ability to squeeze the phone for Google Assistant activation. Definitely worth the price!!","date":"October 25, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHGH736QI7N6H2EFIP4NDXFHCMWQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Andy</a>","link":null}},{"title":"Amazing","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It's a great case. I had a Spigen Rugged Armor for my original Pixel and it blew me away. I dropped it a number of times and the phone was never damaged thanks to the quality of the case.<br><br>I knew right away I needed a Spigen for my Pixel 2. It's firm, the case feels great, and I trust having my device in a Spigen product.<br><br>If you're looking for a case, this is definitely the one.","date":"October 25, 2017","author":{"name":"Andy","link":"/gp/profile/amzn1.account.AHGH736QI7N6H2EFIP4NDXFHCMWQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Excellent cover! It fits the phone perfect and barely ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Buttons are clicky, good grip, nice curve around the sides, feels good in the hands. Great case!","date":"October 24, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AE46YXX3CI4LR5SLNZBUO4Q7XTYA/ref=cm_cr_getr_d_pdp?ie=UTF8\">shad0wz</a>","link":null}},{"title":"It's a great case. I had a Spigen Rugged Armor for ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I love it! It fits my pixel phone just perfect. I will be buying one for her phone. It is always nice to get more than you expected. Great fit and great protection.","date":"November 1, 2017","author":{"name":"shad0wz","link":"/gp/profile/amzn1.account.AE46YXX3CI4LR5SLNZBUO4Q7XTYA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"good grip, nice curve around the sides","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Just put this case on and I already love it. Fit is perfect, buttons feel great and I love the grip. Fantastic in - hand texture. Definitely recommend it.","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGGJAKT3W5RZLGSIBOAZV646IRIA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Ron</a>","link":null}},{"title":"I love it! It fits my pixel phone just perfect","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I love the fit and look of the case. It provides a cover for the side buttons that is practical for someone with fat fingers. I had to return a case with cutouts for the buttons since I could not press them well; with this cover I manipulate the buttons as if there was no cover on the phone! I love it.","date":"October 30, 2017","author":{"name":"Ron","link":"/gp/profile/amzn1.account.AGGJAKT3W5RZLGSIBOAZV646IRIA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Just put this case on and I already love it. Fit is perfect","stars":"a-icon a-icon-star a-star-5 review-rating","body":"This case fits the phone perfectly. Very snug but also easy to take off if needed. The buttons are stiff enough to offer a little resistance in the pocket, but are still very usable. Doesn't obscure the rear camera in any way. Highly recommended case for the Pixel 2.","date":"November 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AF3DDACTPCRHFCEVUYJ4E32LHBDA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Richard</a>","link":null}},{"title":"Best practical and good looking case for your Pixel 2.","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I was wondering deri g whether I should buy one of those trendy skins or a case, I went for the case and was not dissapointed, the case does not increase the bulk of the phone and it increases the grip tremendously, the back feels wonderfully smooth and those \"fiber glass\" inserts add to the grip. The phone hasn't been dropped yet so I will review again once that happens.","date":"November 3, 2017","author":{"name":"Richard","link":"/gp/profile/amzn1.account.AF3DDACTPCRHFCEVUYJ4E32LHBDA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"I purchased the MaxBoost thin Case and it sucked. This one is much better and less slippery. I am very satisfied with it so far.","date":"October 27, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Just placed it on my pixel 2 and looks great! Have had spigen covers before and they've protected my phones properly even though I have a tendency of dropping my phone at least once or twice a month.","date":"October 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"I purchased the MaxBoost thin Case and it sucked. This one is much better and less slippery","stars":"a-icon a-icon-star a-star-1 review-rating","body":"the case is too tight - the fingerprint sensor is lightly off center maybe out of factory or because it is too tight that it is slightly stretched ssuch that the hole is slilghly deformed.  meh.","date":"November 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHH5EIGAO4PAW2AK4NERL2WPEIDQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">TbernzAlm</a>","link":null}},{"title":"Fits and looks great","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It fits perfect and is working as expected with the side buttons. The case is flexible but not quite as flexible like some other cases and I'm a huge fan of the sturdy feel it gives my phone without making it seem bulky or over-sized. It fits perfect with a screen protector on my phone.","date":"October 31, 2017","author":{"name":"TbernzAlm","link":"/gp/profile/amzn1.account.AHH5EIGAO4PAW2AK4NERL2WPEIDQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"the case is too tight - the fingerprint sensor is ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Excellent fit.  You can't go wrong with this if you want a simple case.","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEXBWFVY7G4NOLEAOWR6NGZ6L2DA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Zac C</a>","link":null}},{"title":"It fits perfect and is working as expected with the side buttons","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Another great case from Spigen. I had this case for my S7 and really enjoyed it! Very slim with solid protection. I would recommend it in a heartbeat.","date":"November 3, 2017","author":{"name":"Zac C","link":"/gp/profile/amzn1.account.AEXBWFVY7G4NOLEAOWR6NGZ6L2DA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great, simple case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Awesome case, looks great, love the carbon fiber accents and sleek size. Case wraps all the way around and raised up, good protection.","date":"October 22, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHUBY4WRBAIROTPXOCZK4R7A3ACQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">LK</a>","link":null}},{"title":"Great case as usual from Spigen","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Slick case, fits very nicely on the phone, definitely","date":"November 3, 2017","author":{"name":"LK","link":"/gp/profile/amzn1.account.AHUBY4WRBAIROTPXOCZK4R7A3ACQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Awesome case, looks great","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Good value. Its' well cushioned on the sides and most of the back. Good grip so I don't think it will easily slip out of my hand. Pliable so reaching Hello Google is easy. It's new to me so I haven't drop tested it yet and, hopefully, I won't have to.","date":"November 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHUFRHS57VQON4TYNW7O5IGOS3RA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Agustin Fierros</a>","link":null}},{"title":"Solid case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits the Pixel 2 very well.  Looks slick. Provides good grip. Not bulky.","date":"November 5, 2017","author":{"name":"Agustin Fierros","link":"/gp/profile/amzn1.account.AHUFRHS57VQON4TYNW7O5IGOS3RA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case has been great so far.  It has a perfect fit for the phone.","date":"November 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-1 review-rating","body":"Does not fit pixel 2 phone.<br><br>Case is too large and partially covers finger print scan and camera","date":"December 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Relatively low profile, good grip, fits my Pixel 2 snugly, and all of the buttons are easy to press. The case does make it slightly harder to squeeze the sides of the phone though.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFMW5BNHAQADKYQTNNAHLCPDPMFA/ref=cm_cr_getr_d_pdp?ie=UTF8\">S. Flanders</a>","link":null}},{"title":"One Star","stars":"a-icon a-icon-star a-star-1 review-rating","body":"It says Google Pixel 2 case. When I finally order and receive it, it is Pixel 2 XL case. The description does not fit the actual product. I am returning it rightaway.","date":"December 6, 2017","author":{"name":"S. Flanders","link":"/gp/profile/amzn1.account.AFMW5BNHAQADKYQTNNAHLCPDPMFA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Solid case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"No second thoughts. SPIGEN is THE best as always. Super sturdy","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFXC45KYQEI35ZHLJM7YA3EBUPCQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"It says Google Pixel 2 case. When I finally ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The installation process is very easy and provides a secure fit. The buttons on the case work well and preserve the tactile feedback very well. The case seems quite durable.<br><br>The cut-outs are reasonably well placed, though slightly misaligned around the fingerprint reader and the camera. The chamfered hole for the fingerprint reader greatly aids quickly locating the reader with the finger, which is an unexpected but appreciated feature.<br><br>The case looks sleek, though I don't personally care for the carbon fiber styling.<br><br>It fits well with my Skinomi TechSkin case-friendly screen protector.","date":"November 17, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AFXC45KYQEI35ZHLJM7YA3EBUPCQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Dont think again. Its SPIGEN","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Arrived on time and works as expected.","date":"October 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFUEWNT2EYX5T4NFENF7DBZG7O3A/ref=cm_cr_getr_d_pdp?ie=UTF8\">G1860</a>","link":null}},{"title":"Good fit, durable, and sleek-looking","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Fit is nice, though alignment of holes for camera is slightly off (cosmetic issue only).  Buttons are still responsive and clicky.  Should protect the phone as well as any other TPU style case, which is all you really need.  You don't need a massively thick case to protect against drops unless you're regularly hurling your phone around violently.","date":"November 15, 2017","author":{"name":"G1860","link":"/gp/profile/amzn1.account.AFUEWNT2EYX5T4NFENF7DBZG7O3A/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"nice cover at an affordable price ...  fits the Pixel 2 phone perfectly","date":"October 29, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AECKUBXIHKSGC3RDN4W3JMLYUJGQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Nara Govindarajan</a>","link":null}},{"title":"Relatively nice TPU style case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Absolutely love this case! Fits my Pixel 2 perfectly and securely. Sturdy, thin, smooth. Highly recommend.","date":"November 5, 2017","author":{"name":"Nara Govindarajan","link":"/gp/profile/amzn1.account.AECKUBXIHKSGC3RDN4W3JMLYUJGQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case! Doesnt add a lot of bulk to the phone. Not too grippy so you can still move it in and out of your pocket. Carbon inserts are a nice touch","date":"November 5, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits good and I've had good experiences with Spigen.  I like that it's thin and still has good protection and doesn't show fingerprints","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Great case! Doesnt add a lot of bulk to ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Same case I had on my old Nexus 6P. Doesn't block any sensors and has protected my phone from 3+ 3-4 foot drops so far. Fits like a glove as well.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AESOR4BTRXWR5RGEXDYGS5II4MPQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">fetus19</a>","link":null}},{"title":"Great case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Was just looking for something to keep my Pixel 2 safe while waiting on another case. It fits well and all buttons and squeeze function exactly as they should.","date":"December 2, 2017","author":{"name":"fetus19","link":"/gp/profile/amzn1.account.AESOR4BTRXWR5RGEXDYGS5II4MPQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Fits like a glove as well","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfect, able to utilize all phone functions. Nice protective case, not bulky. Well worth the price.","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AEVD53ZXPLFACXV44LQFFHTSJ7JQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">D. Hoffbauer</a>","link":null}},{"title":"Was just looking for something to keep my Pixel 2 ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Absolutely love my new case! It even came a day earlier than expected which was a pleasant surprise. Would definitely recommend!","date":"October 30, 2017","author":{"name":"D. Hoffbauer","link":"/gp/profile/amzn1.account.AEVD53ZXPLFACXV44LQFFHTSJ7JQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Perfect","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It fits great and looks good.","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHG6LXMZNGUTGPXZYCJ7H4AAPLIA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Zach Pelli</a>","link":null}},{"title":"Very happy with my choice","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Perfect, great feel - this is the right case for the right user.","date":"October 30, 2017","author":{"name":"Zach Pelli","link":"/gp/profile/amzn1.account.AHG6LXMZNGUTGPXZYCJ7H4AAPLIA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits snugly and haven't had any issues with it, hard not to use this phone bare though...","date":"October 30, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGULDAMAF5VQFHYMYKQ6RBCYFYOA/ref=cm_cr_getr_d_pdp?ie=UTF8\">Steven Pociengel</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Exactly what I needed and expected. Spigen will be at the top of my list going forward.","date":"November 3, 2017","author":{"name":"Steven Pociengel","link":"/gp/profile/amzn1.account.AGULDAMAF5VQFHYMYKQ6RBCYFYOA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The case fits perfectly and is super thin.  It looks really nice and high quality.  I love it!","date":"December 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Product arrived in 1 day.<br>Prime customer.<br>Very satisfied.<br>I would buy again.","date":"November 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Good case for the price.","date":"November 3, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AHVKUPO5TJIB3EIQZYFZP6JF25FQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"Very satisfied. I would buy again","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case. Keeps phone protected and looks cool","date":"November 4, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AHVKUPO5TJIB3EIQZYFZP6JF25FQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-4 review-rating","body":"Very happy with this case.  Pretty simple and seems like it will protect the phone.  Haven't tested it in a drop situation yet, but feels like it would help.  It has a nice soft feel to it and is rather thin.  Wish they had a few more color options, but simple goes with the pixel 2.","date":"November 1, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH2DRRTLFFZXHGTNXYU4ETR256RQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">James Burkhardt</a>","link":null}},{"title":"Great Case!!!! Active touch still works!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits great, slim, and feels good in my hand.","date":"December 5, 2017","author":{"name":"James Burkhardt","link":"/gp/profile/amzn1.account.AH2DRRTLFFZXHGTNXYU4ETR256RQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Good simple case","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It arrived so quicly! Great price also!","date":"December 6, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AFP7CHNXZWSUK2C7V3EWAPHNY5JQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Sarah Reeves</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Love my new case! It fits perfectly!","date":"November 28, 2017","author":{"name":"Sarah Reeves","link":"/gp/profile/amzn1.account.AFP7CHNXZWSUK2C7V3EWAPHNY5JQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Great price also","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Great case I really like it .","date":"December 4, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGWDTL4KPYBYSLREKKZWBAG7QRGQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Timothy Miller</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Awesome case!","date":"October 29, 2017","author":{"name":"Timothy Miller","link":"/gp/profile/amzn1.account.AGWDTL4KPYBYSLREKKZWBAG7QRGQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"The phone has arrived!","stars":"a-icon a-icon-star a-star-5 review-rating","body":"Fits perfectly, looks great, feels sturdy.  I'm very happy with it.","date":"November 15, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Emily Osburn","link":null}},{"title":"The case feels sturdy enough, like it would get the job done","stars":"a-icon a-icon-star a-star-5 review-rating","body":"The must-have case for Pixel 2 owners.","date":"November 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span>Amazon Customer","link":null}},{"title":"looks great, feels sturdy","stars":"a-icon a-icon-star a-star-4 review-rating","body":"It fits well and was easy enough to put on. I just dislike the smooth texture. My own texture preferences aside, I think it will do an adequate job keeping my phone protected","date":"November 14, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AG4NTKRPYR7UBRF77IWZWJZHAJTA/ref=cm_cr_getr_d_pdp?ie=UTF8\">kss</a>","link":null}},{"title":"Five Stars","stars":"a-icon a-icon-star a-star-3 review-rating","body":"I probably woudl have given more stars if I had a different screen protector. The one I have (https://www.amazon.com/dp/B074M87ZK6/ref=cm_cr_ryp_prd_ttl_sol_2) covers the screen more, so it doesn't fit with this case. The screen protector kept coming off bec the case isn't compatible with this screen protector.","date":"November 20, 2017","author":{"name":"kss","link":"/gp/profile/amzn1.account.AG4NTKRPYR7UBRF77IWZWJZHAJTA/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"adequate","stars":"a-icon a-icon-star a-star-5 review-rating","body":"It's everything I wanted","date":"November 2, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AH5N2M4BRI2KQZRZISDGETOT3W2Q/ref=cm_cr_getr_d_pdp?ie=UTF8\">I25</a>","link":null}},{"title":"I probably woudl have given more stars if I had ...","stars":"a-icon a-icon-star a-star-5 review-rating","body":"A little slippery but it doesn't stick to my hair and it feels like my phone is protected so I like it.  I love the pattern, it fits perfectly on my Samsung s7 and I would order this again.","date":"October 13, 2017","author":{"name":"I25","link":"/gp/profile/amzn1.account.AH5N2M4BRI2KQZRZISDGETOT3W2Q/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"It's what you want","stars":"a-icon a-icon-star a-star-1 review-rating","body":"Do not buy this for the Google Pixel 2 XL. It says it, but it's not. It says the date, but trust me, this isn't. Now I need to return it.","date":"November 17, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AGMO7EWOHBY2XJDFLJLEZ6ZWTGJQ/ref=cm_cr_getr_d_pdp?ie=UTF8\">Amazon Customer</a>","link":null}},{"title":"Good product, fast shipping","stars":"a-icon a-icon-star a-star-3 review-rating","body":"Of course, I received this before the phone, so I can't speak of how it fits the phone. As far as the case goes, it looks really nice but it feels flimsy. I don't think it will do much protecting in the case of an impact. I've bought $8 cases off of amazon that seem tougher but I will wait until the phone gets here and update my review then.","date":"October 12, 2017","author":{"name":"Amazon Customer","link":"/gp/profile/amzn1.account.AGMO7EWOHBY2XJDFLJLEZ6ZWTGJQ/ref=cm_cr_getr_d_pdp?ie=UTF8"}},{"title":"Not compatible with Google Pixel 2 XL.","stars":"a-icon a-icon-star a-star-3 review-rating","body":"The screen picture appears a little washed out but is useable.<br>The camera has led lights (as stated in the product description), but these are just that, LED lights and not IR lights, so if you want to run the camera all the time, it will be showing a (quite bright) light to the rear. I guess this is why the power plug (cigar lighter type) has an on/off button on it. It does not wire into reverse, but one has to turn it on and off each time it is used.<br>The camera has distance lines which show up on the screen, and which can be useful.<br>The camera bracket does not allow for lateral movement, just vertical up and down movement<br>The camera bracket had to be modified a little as the camera bracket would not tighten down . The screen is exactly the same although it did tighten a little better. This tends to restrict where the display can be placed as it cannot be directed towards the driver at an angle.<br>Plenty of cable supplied but it is a 4 pin DIN-type socket and not the usual 5 pin. For me this was a nuisance as I have a better camera, with IR, but it has a 5 pin connector.<br>For the money, I believe the item is worth it for a fairly trouble-free instal without having to break into the car wiring or reversing switch.","date":"October 26, 2017","author":{"name":"<span class=\"a-color-secondary\">By</span><span class=\"a-letter-space\"></span><a data-hook=\"review-author\" class=\"a-size-base a-link-normal author\" href=\"/gp/profile/amzn1.account.AELHQ6E6CNZ2SYYRC3CH4DCHACQA/ref=cm_cr_getr_d_pdp?ie=UTF8\">jbt</a>","link":null}}]
